KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
// /*=====================================================================================================*/
// /*=====================================================================================================*/
// #include "stm32f4_system.h"
// #include "stm32f4_sdio.h"
// /*=====================================================================================================*/
// /*=====================================================================================================*/
// #define SDIO_STATIC_FLAGS               ((u32)0x000005FF)
// #define SDIO_CMD0TIMEOUT                ((u32)0x00010000)

// #define SD_OCR_ADDR_OUT_OF_RANGE        ((u32)0x80000000)
// #define SD_OCR_ADDR_MISALIGNED          ((u32)0x40000000)
// #define SD_OCR_BLOCK_LEN_ERR            ((u32)0x20000000)
// #define SD_OCR_ERASE_SEQ_ERR            ((u32)0x10000000)
// #define SD_OCR_BAD_ERASE_PARAM          ((u32)0x08000000)
// #define SD_OCR_WRITE_PROT_VIOLATION     ((u32)0x04000000)
// #define SD_OCR_LOCK_UNLOCK_FAILED       ((u32)0x01000000)
// #define SD_OCR_COM_CRC_FAILED           ((u32)0x00800000)
// #define SD_OCR_ILLEGAL_CMD              ((u32)0x00400000)
// #define SD_OCR_CARD_ECC_FAILED          ((u32)0x00200000)
// #define SD_OCR_CC_ERROR                 ((u32)0x00100000)
// #define SD_OCR_GENERAL_UNKNOWN_ERROR    ((u32)0x00080000)
// #define SD_OCR_STREAM_READ_UNDERRUN     ((u32)0x00040000)
// #define SD_OCR_STREAM_WRITE_OVERRUN     ((u32)0x00020000)
// #define SD_OCR_CID_CSD_OVERWRIETE       ((u32)0x00010000)
// #define SD_OCR_WP_ERASE_SKIP            ((u32)0x00008000)
// #define SD_OCR_CARD_ECC_DISABLED        ((u32)0x00004000)
// #define SD_OCR_ERASE_RESET              ((u32)0x00002000)
// #define SD_OCR_AKE_SEQ_ERROR            ((u32)0x00000008)
// #define SD_OCR_ERRORBITS                ((u32)0xFDFFE008)

// #define SD_R6_GENERAL_UNKNOWN_ERROR     ((u32)0x00002000)
// #define SD_R6_ILLEGAL_CMD               ((u32)0x00004000)
// #define SD_R6_COM_CRC_FAILED            ((u32)0x00008000)

// #define SD_VOLTAGE_WINDOW_SD            ((u32)0x80100000)
// #define SD_HIGH_CAPACITY                ((u32)0x40000000)
// #define SD_STD_CAPACITY                 ((u32)0x00000000)
// #define SD_CHECK_PATTERN                ((u32)0x000001AA)

// #define SD_MAX_VOLT_TRIAL               ((u32)0x0000FFFF)
// #define SD_ALLZERO                      ((u32)0x00000000)

// #define SD_WIDE_BUS_SUPPORT             ((u32)0x00040000)
// #define SD_SINGLE_BUS_SUPPORT           ((u32)0x00010000)
// #define SD_CARD_LOCKED                  ((u32)0x02000000)

// #define SD_DATATIMEOUT                  ((u32)0xFFFFFFFF)
// #define SD_0TO7BITS                     ((u32)0x000000FF)
// #define SD_8TO15BITS                    ((u32)0x0000FF00)
// #define SD_16TO23BITS                   ((u32)0x00FF0000)
// #define SD_24TO31BITS                   ((u32)0xFF000000)
// #define SD_MAX_DATA_LENGTH              ((u32)0x01FFFFFF)

// #define SD_HALFFIFO                     ((u32)0x00000008)
// #define SD_HALFFIFOBYTES                ((u32)0x00000020)

// #define SD_CCCC_LOCK_UNLOCK             ((u32)0x00000080)
// #define SD_CCCC_WRITE_PROT              ((u32)0x00000040)
// #define SD_CCCC_ERASE                   ((u32)0x00000020)

// #define SDIO_SEND_IF_COND               ((u32)0x00000008)

// static u32 CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;
// static u32 CSD_Tab[4], CID_Tab[4], RCA = 0;
// static u8 SDSTATUS_Tab[16];
// vu32 StopCondition = 0;
// volatile SD_Error TransferError = SD_OK;
// vu32 TransferEnd = 0, DMAEndOfTransfer = 0;
// SD_CardInfo SDCardInfo;

// SDIO_InitTypeDef SDIO_InitStruct;
// SDIO_CmdInitTypeDef SDIO_CmdInitStruct;
// SDIO_DataInitTypeDef SDIO_DataInitStruct;

// static SD_Error CmdError(void);
// static SD_Error CmdResp1Error(u8 cmd);
// static SD_Error CmdResp7Error(void);
// static SD_Error CmdResp3Error(void);
// static SD_Error CmdResp2Error(void);
// static SD_Error CmdResp6Error(u8 cmd, u16 *prca);
// static SD_Error SDEnWideBus(FunctionalState NewState);
// static SD_Error IsCardProgramming(u8 *pstatus);
// static SD_Error FindSCR(u16 rca, u32 *pscr);
// u8 convert_from_bytes_to_power_of_two(u16 NumberOfBytes);
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// SD_Error SD_Init( void )
// {
// 	GPIO_InitTypeDef  GPIO_InitStruct;
// 	volatile SD_Error ErrSta = SD_OK;

// 	RCC_AHB1PeriphClockCmd(SD_SDIO_DMA_CLK, ENABLE);  
// 	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD, ENABLE);
// 	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);

// 	GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_SDIO);
// 	GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_SDIO);
// 	GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_SDIO);
// 	GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_SDIO);
// 	GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_SDIO);
// 	GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_SDIO);

// 	/* Configure PC.08, PC.09, PC.10, PC.11 pins: D0, D1, D2, D3 pins */
// 	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11;
// 	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_25MHz;
// 	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
// 	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
// 	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
// 	GPIO_Init(GPIOC, &GPIO_InitStruct);
// 	/* Configure PD.02 CMD line */
// 	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
// 	GPIO_Init(GPIOD, &GPIO_InitStruct);
// 	/* Configure PC.12 pin: CLK pin */
// 	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_12;
// 	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
// 	GPIO_Init(GPIOC, &GPIO_InitStruct);

// 	SDIO_DeInit();

// 	ErrSta = SD_PowerON();
// 	/* CMD Response TimeOut (wait for CMDSENT flag) */
// 	if(ErrSta != SD_OK)
// 		return(ErrSta);

