KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
// 	ErrSta = SD_InitializeCards();
// 	/* CMD Response TimeOut (wait for CMDSENT flag) */
// 	if(ErrSta != SD_OK)
// 		return(ErrSta);

// 	/*!< Configure the SDIO peripheral */
// 	/*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
// 	/*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
// 	SDIO_InitStruct.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
// 	SDIO_InitStruct.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
// 	SDIO_InitStruct.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
// 	SDIO_InitStruct.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
// 	SDIO_InitStruct.SDIO_BusWide = SDIO_BusWide_1b;
// 	SDIO_InitStruct.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
// 	SDIO_Init(&SDIO_InitStruct);

// 	/*----------------- Read CSD/CID MSD registers ------------------*/
// 	ErrSta = SD_GetCardInfo(&SDCardInfo);
// 	if(ErrSta == SD_OK)
// 		/*----------------- Select Card --------------------------------*/
// 		ErrSta = SD_SelectDeselect((u32)(SDCardInfo.RCA << 16));
// 	if(ErrSta == SD_OK)
// 		ErrSta = SD_EnableWideBusOperation(SDIO_BusWide_4b);

// 	return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// SDTransferState SD_GetStatus(void)
// {
//   SDCardState cardstate =  SD_CARD_TRANSFER;

//   cardstate = SD_GetState();
//   
//   if (cardstate == SD_CARD_TRANSFER)
//   {
//     return(SD_TRANSFER_OK);
//   }
//   else if(cardstate == SD_CARD_ERROR)
//   {
//     return (SD_TRANSFER_ERROR);
//   }
//   else
//   {
//     return(SD_TRANSFER_BUSY);
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// SDCardState SD_GetState(void)
// {
//   u32 resp1 = 0;
//   
//   if(SD_Detect()== SD_PRESENT)
//   {
//     if (SD_SendStatus(&resp1) != SD_OK)
//     {
//       return SD_CARD_ERROR;
//     }
//     else
//     {
//       return (SDCardState)((resp1 >> 9) & 0x0F);
//     }
//   }
//   else
//   {
//     return SD_CARD_ERROR;
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// u8 SD_Detect(void)
// {
//   vu8 status = SD_PRESENT;

// //   /*!< Check GPIO to detect SD */
// //   if (GPIO_ReadInputDataBit(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) != Bit_RESET)
// //   {
// //     status = SD_NOT_PRESENT;
// //   }
//   return status;
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : SD_PowerON
// **功能 : 
// **輸入 : None
// **輸出 : ErrSta
// **使用 : ErrSta = SD_PowerON()
// **=====================================================================================================*/
// /*=====================================================================================================*/
// SD_Error SD_PowerON( void )
// {
// 	u32 response = 0;
// 	u32 count = 0;
// 	u32 validvoltage = 0;
// 	u32 SDType = SD_STD_CAPACITY;
// 	volatile SD_Error ErrSta = SD_OK;

// 	SDIO_InitStruct.SDIO_ClockDiv = SDIO_INIT_CLK_DIV;
// 	SDIO_InitStruct.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
// 	SDIO_InitStruct.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
// 	SDIO_InitStruct.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
// 	SDIO_InitStruct.SDIO_BusWide = SDIO_BusWide_1b;
// 	SDIO_InitStruct.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
// 	SDIO_Init(&SDIO_InitStruct);

// 	SDIO_SetPowerState(SDIO_PowerState_ON);

// 	SDIO_ClockCmd(ENABLE);

// 	SDIO_CmdInitStruct.SDIO_Argument = 0x00;
// 	SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_GO_IDLE_STATE;
// 	SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_No;
// 	SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
// 	SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
// 	SDIO_SendCommand(&SDIO_CmdInitStruct);

// 	ErrSta = CmdError();
// 	/* CMD Response TimeOut (wait for CMDSENT flag) */
// 	if(ErrSta != SD_OK)
// 		return (ErrSta);

// 	/*!< CMD8: SEND_IF_COND ----------------------------------------------------*/
// 	/*!< Send CMD8 to verify SD card interface operating condition */
// 	/*!< Argument: - [31:12]: Reserved (shall be set to '0')
// 	- [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
// 	- [7:0]: Check Pattern (recommended 0xAA) */
// 	/*!< CMD Response: R7 */
// 	SDIO_CmdInitStruct.SDIO_Argument = SD_CHECK_PATTERN;
// 	SDIO_CmdInitStruct.SDIO_CmdIndex = SDIO_SEND_IF_COND;
// 	SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
// 	SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
// 	SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
// 	SDIO_SendCommand(&SDIO_CmdInitStruct);

// 	ErrSta = CmdResp7Error();
// 	if(ErrSta == SD_OK) {
// 		CardType = SDIO_STD_CAPACITY_SD_CARD_V2_0; /* SD Card 2.0 */
// 		SDType = SD_HIGH_CAPACITY;
// 	}
// 	else {
// 		/* CMD55 */
// 		SDIO_CmdInitStruct.SDIO_Argument = 0x00;
// 		SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
// 		SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
// 		SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
// 		SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
// 		SDIO_SendCommand(&SDIO_CmdInitStruct);
// 		ErrSta = CmdResp1Error(SD_CMD_APP_CMD);
// 	}
// 	/* CMD55 */
// 	SDIO_CmdInitStruct.SDIO_Argument = 0x00;
// 	SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
// 	SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
// 	SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
// 	SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
// 	SDIO_SendCommand(&SDIO_CmdInitStruct);

// 	ErrSta = CmdResp1Error(SD_CMD_APP_CMD);
// 	/* If ErrSta is Command TimeOut, it is a MMC card */
// 	/* If ErrSta is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch) or SD card 1.x */
// 	if(ErrSta == SD_OK) {
// 		/* SD CARD */
// 		/* Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
// 		while((!validvoltage) && (count < SD_MAX_VOLT_TRIAL)) {
// 			/* SEND CMD55 APP_CMD with RCA as 0 */
// 			SDIO_CmdInitStruct.SDIO_Argument = 0x00;
// 			SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
// 			SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
// 			SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
// 			SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
// 			SDIO_SendCommand(&SDIO_CmdInitStruct);

// 			ErrSta = CmdResp1Error(SD_CMD_APP_CMD);
// 			if(ErrSta != SD_OK)
// 				return(ErrSta);

// 			SDIO_CmdInitStruct.SDIO_Argument = SD_VOLTAGE_WINDOW_SD | SDType;
// 			SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SD_APP_OP_COND;
// 			SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
// 			SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
// 			SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
// 			SDIO_SendCommand(&SDIO_CmdInitStruct);

