KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
// 			ErrSta = CmdResp3Error();
// 			if(ErrSta != SD_OK)
// 				return(ErrSta);

// 			response = SDIO_GetResponse(SDIO_RESP1);
// 			validvoltage = (((response >> 31) == 1) ? 1 : 0);
// 			count++;
// 		}
// 		if (count >= SD_MAX_VOLT_TRIAL) {
// 			ErrSta = SD_INVALID_VOLTRANGE;
// 			return(ErrSta);
// 		}
// 		if(response &= SD_HIGH_CAPACITY)
// 			CardType = SDIO_HIGH_CAPACITY_SD_CARD;
// 	}

// 	return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : SD_PowerOFF
// **功能 : 
// **輸入 : None
// **輸出 : ErrSta
// **使用 : ErrSta = SD_PowerOFF()
// **=====================================================================================================*/
// /*=====================================================================================================*/
// SD_Error SD_PowerOFF( void )
// {
// 	SD_Error ErrSta = SD_OK;

// 	/*!< Set Power State to OFF */
// 	SDIO_SetPowerState(SDIO_PowerState_OFF);

// 	return (ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Intialises all cards or single card as the case may be Card(s) come 
//   *         into standby state.
//   * @param  None
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_InitializeCards(void)
// {
//   SD_Error ErrSta = SD_OK;
//   u16 rca = 0x01;

//   if (SDIO_GetPowerState() == SDIO_PowerState_OFF)
//   {
//     ErrSta = SD_REQUEST_NOT_APPLICABLE;
//     return(ErrSta);
//   }

//   if (SDIO_SECURE_DIGITAL_IO_CARD != CardType)
//   {
//     /*!< Send CMD2 ALL_SEND_CID */
//     SDIO_CmdInitStruct.SDIO_Argument = 0x0;
//     SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_ALL_SEND_CID;
//     SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Long;
//     SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//     SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//     SDIO_SendCommand(&SDIO_CmdInitStruct);

//     ErrSta = CmdResp2Error();

//     if (SD_OK != ErrSta)
//     {
//       return(ErrSta);
//     }

//     CID_Tab[0] = SDIO_GetResponse(SDIO_RESP1);
//     CID_Tab[1] = SDIO_GetResponse(SDIO_RESP2);
//     CID_Tab[2] = SDIO_GetResponse(SDIO_RESP3);
//     CID_Tab[3] = SDIO_GetResponse(SDIO_RESP4);
//   }
//   if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) ||  (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) ||  (SDIO_SECURE_DIGITAL_IO_COMBO_CARD == CardType)
//       ||  (SDIO_HIGH_CAPACITY_SD_CARD == CardType))
//   {
//     /*!< Send CMD3 SET_REL_ADDR with argument 0 */
//     /*!< SD Card publishes its RCA. */
//     SDIO_CmdInitStruct.SDIO_Argument = 0x00;
//     SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SET_REL_ADDR;
//     SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//     SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//     SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//     SDIO_SendCommand(&SDIO_CmdInitStruct);

//     ErrSta = CmdResp6Error(SD_CMD_SET_REL_ADDR, &rca);

//     if (SD_OK != ErrSta)
//     {
//       return(ErrSta);
//     }
//   }

//   if (SDIO_SECURE_DIGITAL_IO_CARD != CardType)
//   {
//     RCA = rca;

//     /*!< Send CMD9 SEND_CSD with argument as card's RCA */
//     SDIO_CmdInitStruct.SDIO_Argument = (u32)(rca << 16);
//     SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SEND_CSD;
//     SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Long;
//     SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//     SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//     SDIO_SendCommand(&SDIO_CmdInitStruct);

//     ErrSta = CmdResp2Error();

//     if (SD_OK != ErrSta)
//     {
//       return(ErrSta);
//     }

//     CSD_Tab[0] = SDIO_GetResponse(SDIO_RESP1);
//     CSD_Tab[1] = SDIO_GetResponse(SDIO_RESP2);
//     CSD_Tab[2] = SDIO_GetResponse(SDIO_RESP3);
//     CSD_Tab[3] = SDIO_GetResponse(SDIO_RESP4);
//   }

//   ErrSta = SD_OK; /*!< All cards get intialized */

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Returns information about specific card.
//   * @param  cardinfo: pointer to a SD_CardInfo structure that contains all SD card 
//   *         information.
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_GetCardInfo( SD_CardInfo *cardinfo )
// {
//   SD_Error ErrSta = SD_OK;
//   u8 tmp = 0;

//   cardinfo->CardType = (u8)CardType;
//   cardinfo->RCA = (u16)RCA;

//   /*!< Byte 0 */
//   tmp = (u8)((CSD_Tab[0] & 0xFF000000) >> 24);
//   cardinfo->SD_csd.CSDStruct = (tmp & 0xC0) >> 6;
//   cardinfo->SD_csd.SysSpecVersion = (tmp & 0x3C) >> 2;
//   cardinfo->SD_csd.Reserved1 = tmp & 0x03;

//   /*!< Byte 1 */
//   tmp = (u8)((CSD_Tab[0] & 0x00FF0000) >> 16);
//   cardinfo->SD_csd.TAAC = tmp;

//   /*!< Byte 2 */
//   tmp = (u8)((CSD_Tab[0] & 0x0000FF00) >> 8);
//   cardinfo->SD_csd.NSAC = tmp;

//   /*!< Byte 3 */
//   tmp = (u8)(CSD_Tab[0] & 0x000000FF);
//   cardinfo->SD_csd.MaxBusClkFrec = tmp;

//   /*!< Byte 4 */
//   tmp = (u8)((CSD_Tab[1] & 0xFF000000) >> 24);
//   cardinfo->SD_csd.CardComdClasses = tmp << 4;

//   /*!< Byte 5 */
//   tmp = (u8)((CSD_Tab[1] & 0x00FF0000) >> 16);
//   cardinfo->SD_csd.CardComdClasses |= (tmp & 0xF0) >> 4;
//   cardinfo->SD_csd.RdBlockLen = tmp & 0x0F;

//   /*!< Byte 6 */
//   tmp = (u8)((CSD_Tab[1] & 0x0000FF00) >> 8);
//   cardinfo->SD_csd.PartBlockRead = (tmp & 0x80) >> 7;
//   cardinfo->SD_csd.WrBlockMisalign = (tmp & 0x40) >> 6;
//   cardinfo->SD_csd.RdBlockMisalign = (tmp & 0x20) >> 5;
//   cardinfo->SD_csd.DSRImpl = (tmp & 0x10) >> 4;
//   cardinfo->SD_csd.Reserved2 = 0; /*!< Reserved */

