KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   if((CardType == SDIO_STD_CAPACITY_SD_CARD_V1_1) || (CardType == SDIO_STD_CAPACITY_SD_CARD_V2_0))
//   {
//     cardinfo->SD_csd.DeviceSize = (tmp & 0x03) << 10;

//     /*!< Byte 7 */
//     tmp = (u8)(CSD_Tab[1] & 0x000000FF);
//     cardinfo->SD_csd.DeviceSize |= (tmp) << 2;

//     /*!< Byte 8 */
//     tmp = (u8)((CSD_Tab[2] & 0xFF000000) >> 24);
//     cardinfo->SD_csd.DeviceSize |= (tmp & 0xC0) >> 6;

//     cardinfo->SD_csd.MaxRdCurrentVDDMin = (tmp & 0x38) >> 3;
//     cardinfo->SD_csd.MaxRdCurrentVDDMax = (tmp & 0x07);

//     /*!< Byte 9 */
//     tmp = (u8)((CSD_Tab[2] & 0x00FF0000) >> 16);
//     cardinfo->SD_csd.MaxWrCurrentVDDMin = (tmp & 0xE0) >> 5;
//     cardinfo->SD_csd.MaxWrCurrentVDDMax = (tmp & 0x1C) >> 2;
//     cardinfo->SD_csd.DeviceSizeMul = (tmp & 0x03) << 1;
//     /*!< Byte 10 */
//     tmp = (u8)((CSD_Tab[2] & 0x0000FF00) >> 8);
//     cardinfo->SD_csd.DeviceSizeMul |= (tmp & 0x80) >> 7;
//     
//     cardinfo->CardCapacity = (cardinfo->SD_csd.DeviceSize + 1) ;
//     cardinfo->CardCapacity *= (1 << (cardinfo->SD_csd.DeviceSizeMul + 2));
//     cardinfo->CardBlockSize = 1 << (cardinfo->SD_csd.RdBlockLen);
//     cardinfo->CardCapacity *= cardinfo->CardBlockSize;
//   }
//   else if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
//   {
//     /*!< Byte 7 */
//     tmp = (u8)(CSD_Tab[1] & 0x000000FF);
//     cardinfo->SD_csd.DeviceSize = (tmp & 0x3F) << 16;

//     /*!< Byte 8 */
//     tmp = (u8)((CSD_Tab[2] & 0xFF000000) >> 24);

//     cardinfo->SD_csd.DeviceSize |= (tmp << 8);

//     /*!< Byte 9 */
//     tmp = (u8)((CSD_Tab[2] & 0x00FF0000) >> 16);

//     cardinfo->SD_csd.DeviceSize |= (tmp);

//     /*!< Byte 10 */
//     tmp = (u8)((CSD_Tab[2] & 0x0000FF00) >> 8);
//     
//     cardinfo->CardCapacity = (cardinfo->SD_csd.DeviceSize + 1) * 512 * 1024;
//     cardinfo->CardBlockSize = 512;    
//   }


//   cardinfo->SD_csd.EraseGrSize = (tmp & 0x40) >> 6;
//   cardinfo->SD_csd.EraseGrMul = (tmp & 0x3F) << 1;

//   /*!< Byte 11 */
//   tmp = (u8)(CSD_Tab[2] & 0x000000FF);
//   cardinfo->SD_csd.EraseGrMul |= (tmp & 0x80) >> 7;
//   cardinfo->SD_csd.WrProtectGrSize = (tmp & 0x7F);

//   /*!< Byte 12 */
//   tmp = (u8)((CSD_Tab[3] & 0xFF000000) >> 24);
//   cardinfo->SD_csd.WrProtectGrEnable = (tmp & 0x80) >> 7;
//   cardinfo->SD_csd.ManDeflECC = (tmp & 0x60) >> 5;
//   cardinfo->SD_csd.WrSpeedFact = (tmp & 0x1C) >> 2;
//   cardinfo->SD_csd.MaxWrBlockLen = (tmp & 0x03) << 2;

//   /*!< Byte 13 */
//   tmp = (u8)((CSD_Tab[3] & 0x00FF0000) >> 16);
//   cardinfo->SD_csd.MaxWrBlockLen |= (tmp & 0xC0) >> 6;
//   cardinfo->SD_csd.WriteBlockPaPartial = (tmp & 0x20) >> 5;
//   cardinfo->SD_csd.Reserved3 = 0;
//   cardinfo->SD_csd.ContentProtectAppli = (tmp & 0x01);

//   /*!< Byte 14 */
//   tmp = (u8)((CSD_Tab[3] & 0x0000FF00) >> 8);
//   cardinfo->SD_csd.FileFormatGrouop = (tmp & 0x80) >> 7;
//   cardinfo->SD_csd.CopyFlag = (tmp & 0x40) >> 6;
//   cardinfo->SD_csd.PermWrProtect = (tmp & 0x20) >> 5;
//   cardinfo->SD_csd.TempWrProtect = (tmp & 0x10) >> 4;
//   cardinfo->SD_csd.FileFormat = (tmp & 0x0C) >> 2;
//   cardinfo->SD_csd.ECC = (tmp & 0x03);

//   /*!< Byte 15 */
//   tmp = (u8)(CSD_Tab[3] & 0x000000FF);
//   cardinfo->SD_csd.CSD_CRC = (tmp & 0xFE) >> 1;
//   cardinfo->SD_csd.Reserved4 = 1;


//   /*!< Byte 0 */
//   tmp = (u8)((CID_Tab[0] & 0xFF000000) >> 24);
//   cardinfo->SD_cid.ManufacturerID = tmp;

//   /*!< Byte 1 */
//   tmp = (u8)((CID_Tab[0] & 0x00FF0000) >> 16);
//   cardinfo->SD_cid.OEM_AppliID = tmp << 8;

//   /*!< Byte 2 */
//   tmp = (u8)((CID_Tab[0] & 0x000000FF00) >> 8);
//   cardinfo->SD_cid.OEM_AppliID |= tmp;

//   /*!< Byte 3 */
//   tmp = (u8)(CID_Tab[0] & 0x000000FF);
//   cardinfo->SD_cid.ProdName1 = tmp << 24;

//   /*!< Byte 4 */
//   tmp = (u8)((CID_Tab[1] & 0xFF000000) >> 24);
//   cardinfo->SD_cid.ProdName1 |= tmp << 16;

//   /*!< Byte 5 */
//   tmp = (u8)((CID_Tab[1] & 0x00FF0000) >> 16);
//   cardinfo->SD_cid.ProdName1 |= tmp << 8;

//   /*!< Byte 6 */
//   tmp = (u8)((CID_Tab[1] & 0x0000FF00) >> 8);
//   cardinfo->SD_cid.ProdName1 |= tmp;

//   /*!< Byte 7 */
//   tmp = (u8)(CID_Tab[1] & 0x000000FF);
//   cardinfo->SD_cid.ProdName2 = tmp;

//   /*!< Byte 8 */
//   tmp = (u8)((CID_Tab[2] & 0xFF000000) >> 24);
//   cardinfo->SD_cid.ProdRev = tmp;

//   /*!< Byte 9 */
//   tmp = (u8)((CID_Tab[2] & 0x00FF0000) >> 16);
//   cardinfo->SD_cid.ProdSN = tmp << 24;

//   /*!< Byte 10 */
//   tmp = (u8)((CID_Tab[2] & 0x0000FF00) >> 8);
//   cardinfo->SD_cid.ProdSN |= tmp << 16;

//   /*!< Byte 11 */
//   tmp = (u8)(CID_Tab[2] & 0x000000FF);
//   cardinfo->SD_cid.ProdSN |= tmp << 8;

//   /*!< Byte 12 */
//   tmp = (u8)((CID_Tab[3] & 0xFF000000) >> 24);
//   cardinfo->SD_cid.ProdSN |= tmp;

//   /*!< Byte 13 */
//   tmp = (u8)((CID_Tab[3] & 0x00FF0000) >> 16);
//   cardinfo->SD_cid.Reserved1 |= (tmp & 0xF0) >> 4;
//   cardinfo->SD_cid.ManufactDate = (tmp & 0x0F) << 8;

//   /*!< Byte 14 */
//   tmp = (u8)((CID_Tab[3] & 0x0000FF00) >> 8);
//   cardinfo->SD_cid.ManufactDate |= tmp;

//   /*!< Byte 15 */
//   tmp = (u8)(CID_Tab[3] & 0x000000FF);
//   cardinfo->SD_cid.CID_CRC = (tmp & 0xFE) >> 1;
//   cardinfo->SD_cid.Reserved2 = 1;
//   
//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Enables wide bus opeartion for the requeseted card if supported by 
//   *         card.
//   * @param  WideMode: Specifies the SD card wide bus mode. 
//   *   This parameter can be one of the following values:
//   *     @arg SDIO_BusWide_8b: 8-bit data transfer (Only for MMC)
//   *     @arg SDIO_BusWide_4b: 4-bit data transfer
//   *     @arg SDIO_BusWide_1b: 1-bit data transfer
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_GetCardStatus(SD_CardStatus *cardstatus)
// {
//   SD_Error ErrSta = SD_OK;
//   u8 tmp = 0;

//   ErrSta = SD_SendSDStatus((u32 *)SDSTATUS_Tab);

//   if (ErrSta  != SD_OK)
//   {
//     return(ErrSta);
//   }

//   /*!< Byte 0 */
//   tmp = (u8)((SDSTATUS_Tab[0] & 0xC0) >> 6);
//   cardstatus->DAT_BUS_WIDTH = tmp;

//   /*!< Byte 0 */
//   tmp = (u8)((SDSTATUS_Tab[0] & 0x20) >> 5);
//   cardstatus->SECURED_MODE = tmp;

//   /*!< Byte 2 */
//   tmp = (u8)((SDSTATUS_Tab[2] & 0xFF));
//   cardstatus->SD_CARD_TYPE = tmp << 8;

