KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   /*!< Byte 3 */
//   tmp = (u8)((SDSTATUS_Tab[3] & 0xFF));
//   cardstatus->SD_CARD_TYPE |= tmp;

//   /*!< Byte 4 */
//   tmp = (u8)(SDSTATUS_Tab[4] & 0xFF);
//   cardstatus->SIZE_OF_PROTECTED_AREA = tmp << 24;

//   /*!< Byte 5 */
//   tmp = (u8)(SDSTATUS_Tab[5] & 0xFF);
//   cardstatus->SIZE_OF_PROTECTED_AREA |= tmp << 16;

//   /*!< Byte 6 */
//   tmp = (u8)(SDSTATUS_Tab[6] & 0xFF);
//   cardstatus->SIZE_OF_PROTECTED_AREA |= tmp << 8;

//   /*!< Byte 7 */
//   tmp = (u8)(SDSTATUS_Tab[7] & 0xFF);
//   cardstatus->SIZE_OF_PROTECTED_AREA |= tmp;

//   /*!< Byte 8 */
//   tmp = (u8)((SDSTATUS_Tab[8] & 0xFF));
//   cardstatus->SPEED_CLASS = tmp;

//   /*!< Byte 9 */
//   tmp = (u8)((SDSTATUS_Tab[9] & 0xFF));
//   cardstatus->PERFORMANCE_MOVE = tmp;

//   /*!< Byte 10 */
//   tmp = (u8)((SDSTATUS_Tab[10] & 0xF0) >> 4);
//   cardstatus->AU_SIZE = tmp;

//   /*!< Byte 11 */
//   tmp = (u8)(SDSTATUS_Tab[11] & 0xFF);
//   cardstatus->ERASE_SIZE = tmp << 8;

//   /*!< Byte 12 */
//   tmp = (u8)(SDSTATUS_Tab[12] & 0xFF);
//   cardstatus->ERASE_SIZE |= tmp;

//   /*!< Byte 13 */
//   tmp = (u8)((SDSTATUS_Tab[13] & 0xFC) >> 2);
//   cardstatus->ERASE_TIMEOUT = tmp;

//   /*!< Byte 13 */
//   tmp = (u8)((SDSTATUS_Tab[13] & 0x3));
//   cardstatus->ERASE_OFFSET = tmp;
//  
//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Enables wide bus opeartion for the requeseted card if supported by 
//   *         card.
//   * @param  WideMode: Specifies the SD card wide bus mode. 
//   *   This parameter can be one of the following values:
//   *     @arg SDIO_BusWide_8b: 8-bit data transfer (Only for MMC)
//   *     @arg SDIO_BusWide_4b: 4-bit data transfer
//   *     @arg SDIO_BusWide_1b: 1-bit data transfer
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_EnableWideBusOperation(u32 WideMode)
// {
//   SD_Error ErrSta = SD_OK;

//   /*!< MMC Card doesn't support this feature */
//   if (SDIO_MULTIMEDIA_CARD == CardType)
//   {
//     ErrSta = SD_UNSUPPORTED_FEATURE;
//     return(ErrSta);
//   }
//   else if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType))
//   {
//     if (SDIO_BusWide_8b == WideMode)
//     {
//       ErrSta = SD_UNSUPPORTED_FEATURE;
//       return(ErrSta);
//     }
//     else if (SDIO_BusWide_4b == WideMode)
//     {
//       ErrSta = SDEnWideBus(ENABLE);

//       if (SD_OK == ErrSta)
//       {
//         /*!< Configure the SDIO peripheral */
//         SDIO_InitStruct.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
//         SDIO_InitStruct.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
//         SDIO_InitStruct.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
//         SDIO_InitStruct.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
//         SDIO_InitStruct.SDIO_BusWide = SDIO_BusWide_4b;
//         SDIO_InitStruct.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
//         SDIO_Init(&SDIO_InitStruct);
//       }
//     }
//     else
//     {
//       ErrSta = SDEnWideBus(DISABLE);

//       if (SD_OK == ErrSta)
//       {
//         /*!< Configure the SDIO peripheral */
//         SDIO_InitStruct.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
//         SDIO_InitStruct.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
//         SDIO_InitStruct.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
//         SDIO_InitStruct.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
//         SDIO_InitStruct.SDIO_BusWide = SDIO_BusWide_1b;
//         SDIO_InitStruct.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
//         SDIO_Init(&SDIO_InitStruct);
//       }
//     }
//   }

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Selects od Deselects the corresponding card.
//   * @param  addr: Address of the Card to be selected.
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_SelectDeselect(u32 addr)
// {
//   SD_Error ErrSta = SD_OK;

//   /*!< Send CMD7 SDIO_SEL_DESEL_CARD */
//   SDIO_CmdInitStruct.SDIO_Argument =  addr;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SEL_DESEL_CARD;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_SEL_DESEL_CARD);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Allows to read one block from a specified address in a card. The Data
//   *         transfer can be managed by DMA mode or Polling mode. 
//   * @note   This operation should be followed by two functions to check if the 
//   *         DMA Controller and SD Card status.
//   *          - SD_ReadWaitOperation(): this function insure that the DMA
//   *            controller has finished all data transfer.
//   *          - SD_GetStatus(): to check that the SD Card has finished the 
//   *            data transfer and it is ready for data.            
//   * @param  readbuff: pointer to the buffer that will contain the received data
//   * @param  ReadAddr: Address from where data are to be read.  
//   * @param  BlockSize: the SD card Data block size. The Block size should be 512.
//   * @retval SD_Error: SD Card Error code.
//   */
// void SD_LowLevel_DMA_RxConfig(u32 *BufferDST, u32 BufferSize)
// {
//   DMA_InitTypeDef SDDMA_InitStructure;

//   DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF | SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF | SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);

//   /* DMA2 Stream3  or Stream6 disable */
//   DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);

