KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   ErrSta = CmdResp1Error(SD_CMD_READ_MULT_BLOCK);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//   SDIO_DMACmd(ENABLE);
//   SD_LowLevel_DMA_RxConfig((u32 *)readbuff, (NumberOfBlocks * BlockSize));

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  This function waits until the SDIO DMA data transfer is finished. 
//   *         This function should be called after SDIO_ReadMultiBlocks() function
//   *         to insure that all data sent by the card are already transferred by 
//   *         the DMA controller.
//   * @param  None.
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_WaitReadOperation(void)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 timeout;

//   timeout = SD_DATATIMEOUT;
//   
//   while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == SD_OK) && (timeout > 0))
//   {
//     timeout--;
//   }
//   
//   DMAEndOfTransfer = 0x00;

//   timeout = SD_DATATIMEOUT;
//   
//   while(((SDIO->STA & SDIO_FLAG_RXACT)) && (timeout > 0))
//   {
//     timeout--;  
//   }

//   if (StopCondition == 1)
//   {
//     ErrSta = SD_StopTransfer();
//     StopCondition = 0;
//   }
//   
//   if ((timeout == 0) && (ErrSta == SD_OK))
//   {
//     ErrSta = SD_DATA_TIMEOUT;
//   }
//   
//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);

//   if (TransferError != SD_OK)
//   {
//     return(TransferError);
//   }
//   else
//   {
//     return(ErrSta);  
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Allows to write one block starting from a specified address in a card.
//   *         The Data transfer can be managed by DMA mode or Polling mode.
//   * @note   This operation should be followed by two functions to check if the 
//   *         DMA Controller and SD Card status.
//   *          - SD_ReadWaitOperation(): this function insure that the DMA
//   *            controller has finished all data transfer.
//   *          - SD_GetStatus(): to check that the SD Card has finished the 
//   *            data transfer and it is ready for data.      
//   * @param  writebuff: pointer to the buffer that contain the data to be transferred.
//   * @param  WriteAddr: Address from where data are to be read.   
//   * @param  BlockSize: the SD card Data block size. The Block size should be 512.
//   * @retval SD_Error: SD Card Error code.
//   */
// void SD_LowLevel_DMA_TxConfig(u32 *BufferSRC, u32 BufferSize)
// {
//   DMA_InitTypeDef SDDMA_InitStructure;

//   DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF | SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF | SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);

//   /* DMA2 Stream3  or Stream6 disable */
//   DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);

//   /* DMA2 Stream3  or Stream6 Config */
//   DMA_DeInit(SD_SDIO_DMA_STREAM);

//   SDDMA_InitStructure.DMA_Channel = SD_SDIO_DMA_CHANNEL;
//   SDDMA_InitStructure.DMA_PeripheralBaseAddr = (u32)SDIO_FIFO_ADDRESS;
//   SDDMA_InitStructure.DMA_Memory0BaseAddr = (u32)BufferSRC;
//   SDDMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
//   SDDMA_InitStructure.DMA_BufferSize = 0;
//   SDDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
//   SDDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
//   SDDMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
//   SDDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
//   SDDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
//   SDDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
//   SDDMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
//   SDDMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
//   SDDMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_INC4;
//   SDDMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_INC4;
//   DMA_Init(SD_SDIO_DMA_STREAM, &SDDMA_InitStructure);
//   DMA_ITConfig(SD_SDIO_DMA_STREAM, DMA_IT_TC, ENABLE);
//   DMA_FlowControllerConfig(SD_SDIO_DMA_STREAM, DMA_FlowCtrl_Peripheral);

//   /* DMA2 Stream3  or Stream6 enable */
//   DMA_Cmd(SD_SDIO_DMA_STREAM, ENABLE);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// SD_Error SD_WriteBlock(u8 *writebuff, u32 WriteAddr, u16 BlockSize)
// {
//   SD_Error ErrSta = SD_OK;

//   TransferError = SD_OK;
//   TransferEnd = 0;
//   StopCondition = 0;
//   
//   SDIO->DCTRL = 0x0;


//   if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
//   {
//     BlockSize = 512;
//     WriteAddr /= 512;
//   }

//   /* Set Block Size for Card */ 
//   SDIO_CmdInitStruct.SDIO_Argument = (u32) BlockSize;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

