KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   ErrSta = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

//   if (SD_OK != ErrSta)
//   {
//     return(ErrSta);
//   }
//     
//   /*!< Send CMD24 WRITE_SINGLE_BLOCK */
//   SDIO_CmdInitStruct.SDIO_Argument = WriteAddr;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_WRITE_SINGLE_BLOCK;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_WRITE_SINGLE_BLOCK);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   SDIO_DataInitStruct.SDIO_DataTimeOut = SD_DATATIMEOUT;
//   SDIO_DataInitStruct.SDIO_DataLength = BlockSize;
//   SDIO_DataInitStruct.SDIO_DataBlockSize = (u32) 9 << 4;
//   SDIO_DataInitStruct.SDIO_TransferDir = SDIO_TransferDir_ToCard;
//   SDIO_DataInitStruct.SDIO_TransferMode = SDIO_TransferMode_Block;
//   SDIO_DataInitStruct.SDIO_DPSM = SDIO_DPSM_Enable;
//   SDIO_DataConfig(&SDIO_DataInitStruct);

//   /*!< In case of single data block transfer no need of stop command at all */
//   SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//   SD_LowLevel_DMA_TxConfig((u32 *)writebuff, BlockSize);
//   SDIO_DMACmd(ENABLE);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Allows to write blocks starting from a specified address in a card.
//   *         The Data transfer can be managed by DMA mode only. 
//   * @note   This operation should be followed by two functions to check if the 
//   *         DMA Controller and SD Card status.
//   *          - SD_ReadWaitOperation(): this function insure that the DMA
//   *            controller has finished all data transfer.
//   *          - SD_GetStatus(): to check that the SD Card has finished the 
//   *            data transfer and it is ready for data.     
//   * @param  WriteAddr: Address from where data are to be read.
//   * @param  writebuff: pointer to the buffer that contain the data to be transferred.
//   * @param  BlockSize: the SD card Data block size. The Block size should be 512.
//   * @param  NumberOfBlocks: number of blocks to be written.
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_WriteMultiBlocks(u8 *writebuff, u32 WriteAddr, u16 BlockSize, u32 NumberOfBlocks)
// {
//   SD_Error ErrSta = SD_OK;

//   TransferError = SD_OK;
//   TransferEnd = 0;
//   StopCondition = 1;
//   
//   SDIO->DCTRL = 0x0;

//   if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
//   {
//     BlockSize = 512;
//     WriteAddr /= 512;
//   }

//   /* Set Block Size for Card */ 
//   SDIO_CmdInitStruct.SDIO_Argument = (u32) BlockSize;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

//   if (SD_OK != ErrSta)
//   {
//     return(ErrSta);
//   }
//   
//   /*!< To improve performance */
//   SDIO_CmdInitStruct.SDIO_Argument = (u32) (RCA << 16);
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);


//   ErrSta = CmdResp1Error(SD_CMD_APP_CMD);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }
//   /*!< To improve performance */
//   SDIO_CmdInitStruct.SDIO_Argument = (u32)NumberOfBlocks;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SET_BLOCK_COUNT;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_SET_BLOCK_COUNT);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }


//   /*!< Send CMD25 WRITE_MULT_BLOCK with argument data address */
//   SDIO_CmdInitStruct.SDIO_Argument = (u32)WriteAddr;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_WRITE_MULT_BLOCK;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_WRITE_MULT_BLOCK);

//   if (SD_OK != ErrSta)
//   {
//     return(ErrSta);
//   }

//   SDIO_DataInitStruct.SDIO_DataTimeOut = SD_DATATIMEOUT;
//   SDIO_DataInitStruct.SDIO_DataLength = NumberOfBlocks * BlockSize;
//   SDIO_DataInitStruct.SDIO_DataBlockSize = (u32) 9 << 4;
//   SDIO_DataInitStruct.SDIO_TransferDir = SDIO_TransferDir_ToCard;
//   SDIO_DataInitStruct.SDIO_TransferMode = SDIO_TransferMode_Block;
//   SDIO_DataInitStruct.SDIO_DPSM = SDIO_DPSM_Enable;
//   SDIO_DataConfig(&SDIO_DataInitStruct);

//   SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//   SDIO_DMACmd(ENABLE);
//   SD_LowLevel_DMA_TxConfig((u32 *)writebuff, (NumberOfBlocks * BlockSize));

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  This function waits until the SDIO DMA data transfer is finished. 
//   *         This function should be called after SDIO_WriteBlock() and
//   *         SDIO_WriteMultiBlocks() function to insure that all data sent by the 
//   *         card are already transferred by the DMA controller.        
//   * @param  None.
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_WaitWriteOperation(void)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 timeout;

//   timeout = SD_DATATIMEOUT;
//   
//   while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == SD_OK) && (timeout > 0))
//   {
//     timeout--;
//   }
//   
//   DMAEndOfTransfer = 0x00;

//   timeout = SD_DATATIMEOUT;
//   
//   while(((SDIO->STA & SDIO_FLAG_TXACT)) && (timeout > 0))
//   {
//     timeout--;  
//   }

//   if (StopCondition == 1)
//   {
//     ErrSta = SD_StopTransfer();
//     StopCondition = 0;
//   }
//   
//   if ((timeout == 0) && (ErrSta == SD_OK))
//   {
//     ErrSta = SD_DATA_TIMEOUT;
//   }
//   
//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);
//   
//   if (TransferError != SD_OK)
//   {
//     return(TransferError);
//   }
//   else
//   {
//     return(ErrSta);
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Gets the cuurent data transfer state.
//   * @param  None
//   * @retval SDTransferState: Data Transfer state.
//   *   This value can be: 
//   *        - SD_TRANSFER_OK: No data transfer is acting
//   *        - SD_TRANSFER_BUSY: Data transfer is acting
//   */
// SDTransferState SD_GetTransferState(void)
// {
//   if (SDIO->STA & (SDIO_FLAG_TXACT | SDIO_FLAG_RXACT))
//   {
//     return(SD_TRANSFER_BUSY);
//   }
//   else
//   {
//     return(SD_TRANSFER_OK);
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Aborts an ongoing data transfer.
//   * @param  None
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_StopTransfer(void)
// {
//   SD_Error ErrSta = SD_OK;

//   /*!< Send CMD12 STOP_TRANSMISSION  */
//   SDIO_CmdInitStruct.SDIO_Argument = 0x0;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_STOP_TRANSMISSION;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

