KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   ErrSta = CmdResp1Error(SD_CMD_STOP_TRANSMISSION);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Allows to erase memory area specified for the given card.
//   * @param  startaddr: the start address.
//   * @param  endaddr: the end address.
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_Erase(u32 startaddr, u32 endaddr)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 delay = 0;
//   vu32 maxdelay = 0;
//   u8 cardstate = 0;

//   /*!< Check if the card coomnd class supports erase command */
//   if (((CSD_Tab[1] >> 20) & SD_CCCC_ERASE) == 0)
//   {
//     ErrSta = SD_REQUEST_NOT_APPLICABLE;
//     return(ErrSta);
//   }

//   maxdelay = 120000 / ((SDIO->CLKCR & 0xFF) + 2);

//   if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED)
//   {
//     ErrSta = SD_LOCK_UNLOCK_FAILED;
//     return(ErrSta);
//   }

//   if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
//   {
//     startaddr /= 512;
//     endaddr /= 512;
//   }
//   
//   /*!< According to sd-card spec 1.0 ERASE_GROUP_START (CMD32) and erase_group_end(CMD33) */
//   if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType))
//   {
//     /*!< Send CMD32 SD_ERASE_GRP_START with argument as addr  */
//     SDIO_CmdInitStruct.SDIO_Argument = startaddr;
//     SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SD_ERASE_GRP_START;
//     SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//     SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//     SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//     SDIO_SendCommand(&SDIO_CmdInitStruct);

//     ErrSta = CmdResp1Error(SD_CMD_SD_ERASE_GRP_START);
//     if (ErrSta != SD_OK)
//     {
//       return(ErrSta);
//     }

//     /*!< Send CMD33 SD_ERASE_GRP_END with argument as addr  */
//     SDIO_CmdInitStruct.SDIO_Argument = endaddr;
//     SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SD_ERASE_GRP_END;
//     SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//     SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//     SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//     SDIO_SendCommand(&SDIO_CmdInitStruct);

//     ErrSta = CmdResp1Error(SD_CMD_SD_ERASE_GRP_END);
//     if (ErrSta != SD_OK)
//     {
//       return(ErrSta);
//     }
//   }

//   /*!< Send CMD38 ERASE */
//   SDIO_CmdInitStruct.SDIO_Argument = 0;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_ERASE;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_ERASE);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   for (delay = 0; delay < maxdelay; delay++)
//   {}

//   /*!< Wait till the card is in programming state */
//   ErrSta = IsCardProgramming(&cardstate);
//   delay = SD_DATATIMEOUT;
//   while ((delay > 0) && (ErrSta == SD_OK) && ((SD_CARD_PROGRAMMING == cardstate) || (SD_CARD_RECEIVING == cardstate)))
//   {
//     ErrSta = IsCardProgramming(&cardstate);
//     delay--;
//   }

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Returns the current card's status.
//   * @param  pcardstatus: pointer to the buffer that will contain the SD card 
//   *         status (Card Status register).
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_SendStatus(u32 *pcardstatus)
// {
//   SD_Error ErrSta = SD_OK;

//   if (pcardstatus == NULL)
//   {
//     ErrSta = SD_INVALID_PARAMETER;
//     return(ErrSta);
//   }

//   SDIO_CmdInitStruct.SDIO_Argument = (u32) RCA << 16;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_SEND_STATUS);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   *pcardstatus = SDIO_GetResponse(SDIO_RESP1);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Returns the current SD card's status.
//   * @param  psdstatus: pointer to the buffer that will contain the SD card status 
//   *         (SD Status register).
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_SendSDStatus(u32 *psdstatus)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 count = 0;

//   if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED)
//   {
//     ErrSta = SD_LOCK_UNLOCK_FAILED;
//     return(ErrSta);
//   }

//   /*!< Set block size for card if it is not equal to current block size for card. */
//   SDIO_CmdInitStruct.SDIO_Argument = 64;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

