KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   ErrSta = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   /*!< CMD55 */
//   SDIO_CmdInitStruct.SDIO_Argument = (u32) RCA << 16;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);
//   ErrSta = CmdResp1Error(SD_CMD_APP_CMD);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   SDIO_DataInitStruct.SDIO_DataTimeOut = SD_DATATIMEOUT;
//   SDIO_DataInitStruct.SDIO_DataLength = 64;
//   SDIO_DataInitStruct.SDIO_DataBlockSize = SDIO_DataBlockSize_64b;
//   SDIO_DataInitStruct.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
//   SDIO_DataInitStruct.SDIO_TransferMode = SDIO_TransferMode_Block;
//   SDIO_DataInitStruct.SDIO_DPSM = SDIO_DPSM_Enable;
//   SDIO_DataConfig(&SDIO_DataInitStruct);

//   /*!< Send ACMD13 SD_APP_STAUS  with argument as card's RCA.*/
//   SDIO_CmdInitStruct.SDIO_Argument = 0;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SD_APP_STAUS;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);
//   ErrSta = CmdResp1Error(SD_CMD_SD_APP_STAUS);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
//   {
//     if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
//     {
//       for (count = 0; count < 8; count++)
//       {
//         *(psdstatus + count) = SDIO_ReadData();
//       }
//       psdstatus += 8;
//     }
//   }

//   if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
//     ErrSta = SD_DATA_TIMEOUT;
//     return(ErrSta);
//   }
//   else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
//     ErrSta = SD_DATA_CRC_FAIL;
//     return(ErrSta);
//   }
//   else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
//     ErrSta = SD_RX_OVERRUN;
//     return(ErrSta);
//   }
//   else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_STBITERR);
//     ErrSta = SD_START_BIT_ERR;
//     return(ErrSta);
//   }

//   count = SD_DATATIMEOUT;
//   while ((SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) && (count > 0))
//   {
//     *psdstatus = SDIO_ReadData();
//     psdstatus++;
//     count--;
//   }
//   /*!< Clear all the static status flags*/
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Allows to process all the interrupts that are high.
//   * @param  None
//   * @retval SD_Error: SD Card Error code.
//   */
// SD_Error SD_ProcessIRQSrc(void)
// { 
//   if (SDIO_GetITStatus(SDIO_IT_DATAEND) != RESET)
//   {
//     TransferError = SD_OK;
//     SDIO_ClearITPendingBit(SDIO_IT_DATAEND);
//     TransferEnd = 1;
//   }  
//   else if (SDIO_GetITStatus(SDIO_IT_DCRCFAIL) != RESET)
//   {
//     SDIO_ClearITPendingBit(SDIO_IT_DCRCFAIL);
//     TransferError = SD_DATA_CRC_FAIL;
//   }
//   else if (SDIO_GetITStatus(SDIO_IT_DTIMEOUT) != RESET)
//   {
//     SDIO_ClearITPendingBit(SDIO_IT_DTIMEOUT);
//     TransferError = SD_DATA_TIMEOUT;
//   }
//   else if (SDIO_GetITStatus(SDIO_IT_RXOVERR) != RESET)
//   {
//     SDIO_ClearITPendingBit(SDIO_IT_RXOVERR);
//     TransferError = SD_RX_OVERRUN;
//   }
//   else if (SDIO_GetITStatus(SDIO_IT_TXUNDERR) != RESET)
//   {
//     SDIO_ClearITPendingBit(SDIO_IT_TXUNDERR);
//     TransferError = SD_TX_UNDERRUN;
//   }
//   else if (SDIO_GetITStatus(SDIO_IT_STBITERR) != RESET)
//   {
//     SDIO_ClearITPendingBit(SDIO_IT_STBITERR);
//     TransferError = SD_START_BIT_ERR;
//   }

//   SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND |
//                 SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
//                 SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
//   return(TransferError);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  This function waits until the SDIO DMA data transfer is finished. 
//   * @param  None.
//   * @retval None.
//   */
// void SD_ProcessDMAIRQ(void)
// {
//   if(DMA2->LISR & SD_SDIO_DMA_FLAG_TCIF)
//   {
//     DMAEndOfTransfer = 0x01;
//     DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_TCIF|SD_SDIO_DMA_FLAG_FEIF);
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : CmdError
// **功能 : Checks for error conditions for CMD0
// **輸入 : None
// **輸出 : ErrSta
// **使用 : ErrSta = CmdError()
// **=====================================================================================================*/
// /*=====================================================================================================*/
// static SD_Error CmdError( void )
// {
// 	u32 TimeOut;
// 	SD_Error ErrSta = SD_OK;

// 	TimeOut = SDIO_CMD0TIMEOUT; /*!< 10000 */

