KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
// 	while((TimeOut > 0) && (SDIO_GetFlagStatus(SDIO_FLAG_CMDSENT) == RESET))
// 		TimeOut--;

// 	if(TimeOut == 0) {
// 		ErrSta = SD_CMD_RSP_TIMEOUT;
// 		return (ErrSta);
// 	}

// 	SDIO_ClearFlag(SDIO_STATIC_FLAGS);

// 	return (ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : CmdResp7Error
// **功能 : Checks for error conditions for R7 response
// **輸入 : None
// **輸出 : ErrSta
// **使用 : ErrSta = CmdResp7Error()
// **=====================================================================================================*/
// /*=====================================================================================================*/
// static SD_Error CmdResp7Error( void )
// {
// 	u32 Status;
// 	u32 TimeOut = SDIO_CMD0TIMEOUT;
// 	SD_Error ErrSta = SD_OK;

// 	Status = SDIO->STA;

// 	while(!(Status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) && (TimeOut > 0)) {
// 		TimeOut--;
// 		Status = SDIO->STA;
// 	}

// 	if((TimeOut == 0) || (Status & SDIO_FLAG_CTIMEOUT)) {
// 		/* Card is not V2.0 complient or card does not support the set voltage range */
// 		ErrSta = SD_CMD_RSP_TIMEOUT;
// 		SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
// 		return (ErrSta);
// 	}

// 	if(Status & SDIO_FLAG_CMDREND) {
// 		/* Card is SD V2.0 compliant */
// 		ErrSta = SD_OK;
// 		SDIO_ClearFlag(SDIO_FLAG_CMDREND);
// 		return (ErrSta);
// 	}

// 	return (ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Checks for error conditions for R1 response.
//   * @param  cmd: The sent command index.
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error CmdResp1Error(u8 cmd)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 status;
//   u32 response_r1;

//   status = SDIO->STA;

//   while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
//   {
//     status = SDIO->STA;
//   }

//   if (status & SDIO_FLAG_CTIMEOUT)
//   {
//     ErrSta = SD_CMD_RSP_TIMEOUT;
//     SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
//     return(ErrSta);
//   }
//   else if (status & SDIO_FLAG_CCRCFAIL)
//   {
//     ErrSta = SD_CMD_CRC_FAIL;
//     SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
//     return(ErrSta);
//   }

//   /*!< Check response received is of desired command */
//   if (SDIO_GetCommandResponse() != cmd)
//   {
//     ErrSta = SD_ILLEGAL_CMD;
//     return(ErrSta);
//   }

//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);

//   /*!< We have received response, retrieve it for analysis  */
//   response_r1 = SDIO_GetResponse(SDIO_RESP1);

//   if ((response_r1 & SD_OCR_ERRORBITS) == SD_ALLZERO)
//   {
//     return(ErrSta);
//   }

//   if (response_r1 & SD_OCR_ADDR_OUT_OF_RANGE)
//   {
//     return(SD_ADDR_OUT_OF_RANGE);
//   }

//   if (response_r1 & SD_OCR_ADDR_MISALIGNED)
//   {
//     return(SD_ADDR_MISALIGNED);
//   }

//   if (response_r1 & SD_OCR_BLOCK_LEN_ERR)
//   {
//     return(SD_BLOCK_LEN_ERR);
//   }

//   if (response_r1 & SD_OCR_ERASE_SEQ_ERR)
//   {
//     return(SD_ERASE_SEQ_ERR);
//   }

//   if (response_r1 & SD_OCR_BAD_ERASE_PARAM)
//   {
//     return(SD_BAD_ERASE_PARAM);
//   }

//   if (response_r1 & SD_OCR_WRITE_PROT_VIOLATION)
//   {
//     return(SD_WRITE_PROT_VIOLATION);
//   }

//   if (response_r1 & SD_OCR_LOCK_UNLOCK_FAILED)
//   {
//     return(SD_LOCK_UNLOCK_FAILED);
//   }

//   if (response_r1 & SD_OCR_COM_CRC_FAILED)
//   {
//     return(SD_COM_CRC_FAILED);
//   }

//   if (response_r1 & SD_OCR_ILLEGAL_CMD)
//   {
//     return(SD_ILLEGAL_CMD);
//   }

//   if (response_r1 & SD_OCR_CARD_ECC_FAILED)
//   {
//     return(SD_CARD_ECC_FAILED);
//   }

//   if (response_r1 & SD_OCR_CC_ERROR)
//   {
//     return(SD_CC_ERROR);
//   }

//   if (response_r1 & SD_OCR_GENERAL_UNKNOWN_ERROR)
//   {
//     return(SD_GENERAL_UNKNOWN_ERROR);
//   }

//   if (response_r1 & SD_OCR_STREAM_READ_UNDERRUN)
//   {
//     return(SD_STREAM_READ_UNDERRUN);
//   }

//   if (response_r1 & SD_OCR_STREAM_WRITE_OVERRUN)
//   {
//     return(SD_STREAM_WRITE_OVERRUN);
//   }

//   if (response_r1 & SD_OCR_CID_CSD_OVERWRIETE)
//   {
//     return(SD_CID_CSD_OVERWRITE);
//   }

//   if (response_r1 & SD_OCR_WP_ERASE_SKIP)
//   {
//     return(SD_WP_ERASE_SKIP);
//   }

//   if (response_r1 & SD_OCR_CARD_ECC_DISABLED)
//   {
//     return(SD_CARD_ECC_DISABLED);
//   }

//   if (response_r1 & SD_OCR_ERASE_RESET)
//   {
//     return(SD_ERASE_RESET);
//   }

//   if (response_r1 & SD_OCR_AKE_SEQ_ERROR)
//   {
//     return(SD_AKE_SEQ_ERROR);
//   }
//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Checks for error conditions for R3 (OCR) response.
//   * @param  None
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error CmdResp3Error(void)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 status;

//   status = SDIO->STA;

//   while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
//   {
//     status = SDIO->STA;
//   }

//   if (status & SDIO_FLAG_CTIMEOUT)
//   {
//     ErrSta = SD_CMD_RSP_TIMEOUT;
//     SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
//     return(ErrSta);
//   }
//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);
//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Checks for error conditions for R2 (CID or CSD) response.
//   * @param  None
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error CmdResp2Error(void)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 status;

//   status = SDIO->STA;

//   while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CTIMEOUT | SDIO_FLAG_CMDREND)))
//   {
//     status = SDIO->STA;
//   }

//   if (status & SDIO_FLAG_CTIMEOUT)
//   {
//     ErrSta = SD_CMD_RSP_TIMEOUT;
//     SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
//     return(ErrSta);
//   }
//   else if (status & SDIO_FLAG_CCRCFAIL)
//   {
//     ErrSta = SD_CMD_CRC_FAIL;
//     SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
//     return(ErrSta);
//   }

