KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Checks for error conditions for R6 (RCA) response.
//   * @param  cmd: The sent command index.
//   * @param  prca: pointer to the variable that will contain the SD card relative 
//   *         address RCA. 
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error CmdResp6Error(u8 cmd, u16 *prca)
// {
//   SD_Error ErrSta = SD_OK;
//   u32 status;
//   u32 response_r1;

//   status = SDIO->STA;

//   while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CTIMEOUT | SDIO_FLAG_CMDREND)))
//   {
//     status = SDIO->STA;
//   }

//   if (status & SDIO_FLAG_CTIMEOUT)
//   {
//     ErrSta = SD_CMD_RSP_TIMEOUT;
//     SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
//     return(ErrSta);
//   }
//   else if (status & SDIO_FLAG_CCRCFAIL)
//   {
//     ErrSta = SD_CMD_CRC_FAIL;
//     SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
//     return(ErrSta);
//   }

//   /*!< Check response received is of desired command */
//   if (SDIO_GetCommandResponse() != cmd)
//   {
//     ErrSta = SD_ILLEGAL_CMD;
//     return(ErrSta);
//   }

//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);

//   /*!< We have received response, retrieve it.  */
//   response_r1 = SDIO_GetResponse(SDIO_RESP1);

//   if (SD_ALLZERO == (response_r1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)))
//   {
//     *prca = (u16) (response_r1 >> 16);
//     return(ErrSta);
//   }

//   if (response_r1 & SD_R6_GENERAL_UNKNOWN_ERROR)
//   {
//     return(SD_GENERAL_UNKNOWN_ERROR);
//   }

//   if (response_r1 & SD_R6_ILLEGAL_CMD)
//   {
//     return(SD_ILLEGAL_CMD);
//   }

//   if (response_r1 & SD_R6_COM_CRC_FAILED)
//   {
//     return(SD_COM_CRC_FAILED);
//   }

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Enables or disables the SDIO wide bus mode.
//   * @param  NewState: new state of the SDIO wide bus mode.
//   *   This parameter can be: ENABLE or DISABLE.
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error SDEnWideBus(FunctionalState NewState)
// {
//   SD_Error ErrSta = SD_OK;

//   u32 scr[2] = {0, 0};

//   if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED)
//   {
//     ErrSta = SD_LOCK_UNLOCK_FAILED;
//     return(ErrSta);
//   }

//   /*!< Get SCR Register */
//   ErrSta = FindSCR(RCA, scr);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   /*!< If wide bus operation to be enabled */
//   if (NewState == ENABLE)
//   {
//     /*!< If requested card supports wide bus operation */
//     if ((scr[1] & SD_WIDE_BUS_SUPPORT) != SD_ALLZERO)
//     {
//       /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
//       SDIO_CmdInitStruct.SDIO_Argument = (u32) RCA << 16;
//       SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
//       SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//       SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//       SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//       SDIO_SendCommand(&SDIO_CmdInitStruct);

//       ErrSta = CmdResp1Error(SD_CMD_APP_CMD);

//       if (ErrSta != SD_OK)
//       {
//         return(ErrSta);
//       }

//       /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
//       SDIO_CmdInitStruct.SDIO_Argument = 0x2;
//       SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_SD_SET_BUSWIDTH;
//       SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//       SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//       SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//       SDIO_SendCommand(&SDIO_CmdInitStruct);

//       ErrSta = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);

//       if (ErrSta != SD_OK)
//       {
//         return(ErrSta);
//       }
//       return(ErrSta);
//     }
//     else
//     {
//       ErrSta = SD_REQUEST_NOT_APPLICABLE;
//       return(ErrSta);
//     }
//   }   /*!< If wide bus operation to be disabled */
//   else
//   {
//     /*!< If requested card supports 1 bit mode operation */
//     if ((scr[1] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO)
//     {
//       /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
//       SDIO_CmdInitStruct.SDIO_Argument = (u32) RCA << 16;
//       SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
//       SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//       SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//       SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//       SDIO_SendCommand(&SDIO_CmdInitStruct);


//       ErrSta = CmdResp1Error(SD_CMD_APP_CMD);

//       if (ErrSta != SD_OK)
//       {
//         return(ErrSta);
//       }

//       /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
//       SDIO_CmdInitStruct.SDIO_Argument = 0x00;
//       SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_SD_SET_BUSWIDTH;
//       SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//       SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//       SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//       SDIO_SendCommand(&SDIO_CmdInitStruct);

//       ErrSta = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);

//       if (ErrSta != SD_OK)
//       {
//         return(ErrSta);
//       }

