KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//       return(ErrSta);
//     }
//     else
//     {
//       ErrSta = SD_REQUEST_NOT_APPLICABLE;
//       return(ErrSta);
//     }
//   }
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Checks if the SD card is in programming state.
//   * @param  pstatus: pointer to the variable that will contain the SD card state.
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error IsCardProgramming(u8 *pstatus)
// {
//   SD_Error ErrSta = SD_OK;
//   vu32 respR1 = 0, status = 0;

//   SDIO_CmdInitStruct.SDIO_Argument = (u32) RCA << 16;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   status = SDIO->STA;
//   while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
//   {
//     status = SDIO->STA;
//   }

//   if (status & SDIO_FLAG_CTIMEOUT)
//   {
//     ErrSta = SD_CMD_RSP_TIMEOUT;
//     SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
//     return(ErrSta);
//   }
//   else if (status & SDIO_FLAG_CCRCFAIL)
//   {
//     ErrSta = SD_CMD_CRC_FAIL;
//     SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
//     return(ErrSta);
//   }

//   status = (u32)SDIO_GetCommandResponse();

//   /*!< Check response received is of desired command */
//   if (status != SD_CMD_SEND_STATUS)
//   {
//     ErrSta = SD_ILLEGAL_CMD;
//     return(ErrSta);
//   }

//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);


//   /*!< We have received response, retrieve it for analysis  */
//   respR1 = SDIO_GetResponse(SDIO_RESP1);

//   /*!< Find out card status */
//   *pstatus = (u8) ((respR1 >> 9) & 0x0000000F);

//   if ((respR1 & SD_OCR_ERRORBITS) == SD_ALLZERO)
//   {
//     return(ErrSta);
//   }

//   if (respR1 & SD_OCR_ADDR_OUT_OF_RANGE)
//   {
//     return(SD_ADDR_OUT_OF_RANGE);
//   }

//   if (respR1 & SD_OCR_ADDR_MISALIGNED)
//   {
//     return(SD_ADDR_MISALIGNED);
//   }

//   if (respR1 & SD_OCR_BLOCK_LEN_ERR)
//   {
//     return(SD_BLOCK_LEN_ERR);
//   }

//   if (respR1 & SD_OCR_ERASE_SEQ_ERR)
//   {
//     return(SD_ERASE_SEQ_ERR);
//   }

//   if (respR1 & SD_OCR_BAD_ERASE_PARAM)
//   {
//     return(SD_BAD_ERASE_PARAM);
//   }

//   if (respR1 & SD_OCR_WRITE_PROT_VIOLATION)
//   {
//     return(SD_WRITE_PROT_VIOLATION);
//   }

//   if (respR1 & SD_OCR_LOCK_UNLOCK_FAILED)
//   {
//     return(SD_LOCK_UNLOCK_FAILED);
//   }

//   if (respR1 & SD_OCR_COM_CRC_FAILED)
//   {
//     return(SD_COM_CRC_FAILED);
//   }

//   if (respR1 & SD_OCR_ILLEGAL_CMD)
//   {
//     return(SD_ILLEGAL_CMD);
//   }

//   if (respR1 & SD_OCR_CARD_ECC_FAILED)
//   {
//     return(SD_CARD_ECC_FAILED);
//   }

//   if (respR1 & SD_OCR_CC_ERROR)
//   {
//     return(SD_CC_ERROR);
//   }

//   if (respR1 & SD_OCR_GENERAL_UNKNOWN_ERROR)
//   {
//     return(SD_GENERAL_UNKNOWN_ERROR);
//   }

//   if (respR1 & SD_OCR_STREAM_READ_UNDERRUN)
//   {
//     return(SD_STREAM_READ_UNDERRUN);
//   }

//   if (respR1 & SD_OCR_STREAM_WRITE_OVERRUN)
//   {
//     return(SD_STREAM_WRITE_OVERRUN);
//   }

//   if (respR1 & SD_OCR_CID_CSD_OVERWRIETE)
//   {
//     return(SD_CID_CSD_OVERWRITE);
//   }

//   if (respR1 & SD_OCR_WP_ERASE_SKIP)
//   {
//     return(SD_WP_ERASE_SKIP);
//   }

//   if (respR1 & SD_OCR_CARD_ECC_DISABLED)
//   {
//     return(SD_CARD_ECC_DISABLED);
//   }

//   if (respR1 & SD_OCR_ERASE_RESET)
//   {
//     return(SD_ERASE_RESET);
//   }

//   if (respR1 & SD_OCR_AKE_SEQ_ERROR)
//   {
//     return(SD_AKE_SEQ_ERROR);
//   }

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Find the SD card SCR register value.
//   * @param  rca: selected card address.
//   * @param  pscr: pointer to the buffer that will contain the SCR value.
//   * @retval SD_Error: SD Card Error code.
//   */
// static SD_Error FindSCR(u16 rca, u32 *pscr)
// {
//   u32 index = 0;
//   SD_Error ErrSta = SD_OK;
//   u32 tempscr[2] = {0, 0};

//   /*!< Set Block Size To 8 Bytes */
//   /*!< Send CMD55 APP_CMD with argument as card's RCA */
//   SDIO_CmdInitStruct.SDIO_Argument = (u32)8;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   /*!< Send CMD55 APP_CMD with argument as card's RCA */
//   SDIO_CmdInitStruct.SDIO_Argument = (u32) RCA << 16;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_APP_CMD;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_APP_CMD);

//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }
//   SDIO_DataInitStruct.SDIO_DataTimeOut = SD_DATATIMEOUT;
//   SDIO_DataInitStruct.SDIO_DataLength = 8;
//   SDIO_DataInitStruct.SDIO_DataBlockSize = SDIO_DataBlockSize_8b;
//   SDIO_DataInitStruct.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
//   SDIO_DataInitStruct.SDIO_TransferMode = SDIO_TransferMode_Block;
//   SDIO_DataInitStruct.SDIO_DPSM = SDIO_DPSM_Enable;
//   SDIO_DataConfig(&SDIO_DataInitStruct);


//   /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
//   SDIO_CmdInitStruct.SDIO_Argument = 0x0;
//   SDIO_CmdInitStruct.SDIO_CmdIndex = SD_CMD_SD_APP_SEND_SCR;
//   SDIO_CmdInitStruct.SDIO_Response = SDIO_Response_Short;
//   SDIO_CmdInitStruct.SDIO_Wait = SDIO_Wait_No;
//   SDIO_CmdInitStruct.SDIO_CPSM = SDIO_CPSM_Enable;
//   SDIO_SendCommand(&SDIO_CmdInitStruct);

//   ErrSta = CmdResp1Error(SD_CMD_SD_APP_SEND_SCR);

