KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
//   if (ErrSta != SD_OK)
//   {
//     return(ErrSta);
//   }

//   while (!(SDIO->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
//   {
//     if (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)
//     {
//       *(tempscr + index) = SDIO_ReadData();
//       index++;
//     }
//   }

//   if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
//     ErrSta = SD_DATA_TIMEOUT;
//     return(ErrSta);
//   }
//   else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
//     ErrSta = SD_DATA_CRC_FAIL;
//     return(ErrSta);
//   }
//   else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
//     ErrSta = SD_RX_OVERRUN;
//     return(ErrSta);
//   }
//   else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
//   {
//     SDIO_ClearFlag(SDIO_FLAG_STBITERR);
//     ErrSta = SD_START_BIT_ERR;
//     return(ErrSta);
//   }

//   /*!< Clear all the static flags */
//   SDIO_ClearFlag(SDIO_STATIC_FLAGS);

//   *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS) << 24) | ((tempscr[0] & SD_8TO15BITS) << 8) | ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

//   *(pscr) = ((tempscr[1] & SD_0TO7BITS) << 24) | ((tempscr[1] & SD_8TO15BITS) << 8) | ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);

//   return(ErrSta);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*
// **函數 : 
// **功能 : 
// **輸入 : 
// **輸出 : 
// **使用 : 
// **=====================================================================================================*/
// /*=====================================================================================================*/
// /**
//   * @brief  Converts the number of bytes in power of two and returns the power.
//   * @param  NumberOfBytes: number of bytes.
//   * @retval None
//   */
// u8 convert_from_bytes_to_power_of_two(u16 NumberOfBytes)
// {
//   u8 count = 0;

//   while (NumberOfBytes != 1)
//   {
//     NumberOfBytes >>= 1;
//     count++;
//   }
//   return(count);
// }
// /*=====================================================================================================*/
// /*=====================================================================================================*/




































/* Includes ------------------------------------------------------------------*/
#include "stm32f4_system.h"
#include "stm32f4_sdio.h"

/** @addtogroup Utilities
* @{
*/ 

/** @addtogroup STM32_EVAL
* @{
*/ 

/** @addtogroup STM324xG_EVAL
* @{
*/

/** @addtogroup STM324xG_EVAL_SDIO_SD
* @brief      This file provides all the SD Card driver firmware functions.
* @{
*/ 

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Types
* @{
*/ 
/**
* @}
*/ 


/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Defines
* @{
*/ 

/** 
* @brief  SDIO Static flags, TimeOut, FIFO Address  
*/
#define NULL 0
#define SDIO_STATIC_FLAGS               ((uint32_t)0x000005FF)
#define SDIO_CMD0TIMEOUT                ((uint32_t)0x00010000)

/** 
* @brief  Mask for errors Card Status R1 (OCR Register) 
*/
#define SD_OCR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000)
#define SD_OCR_ADDR_MISALIGNED          ((uint32_t)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR            ((uint32_t)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR            ((uint32_t)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM          ((uint32_t)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000)
#define SD_OCR_COM_CRC_FAILED           ((uint32_t)0x00800000)
#define SD_OCR_ILLEGAL_CMD              ((uint32_t)0x00400000)
#define SD_OCR_CARD_ECC_FAILED          ((uint32_t)0x00200000)
#define SD_OCR_CC_ERROR                 ((uint32_t)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000)
#define SD_OCR_CID_CSD_OVERWRIETE       ((uint32_t)0x00010000)
#define SD_OCR_WP_ERASE_SKIP            ((uint32_t)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED        ((uint32_t)0x00004000)
#define SD_OCR_ERASE_RESET              ((uint32_t)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR            ((uint32_t)0x00000008)
#define SD_OCR_ERRORBITS                ((uint32_t)0xFDFFE008)

/** 
* @brief  Masks for R6 Response 
*/
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((uint32_t)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((uint32_t)0x00008000)

#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x80100000)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AA)

#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                      ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000)

#define SD_DATATIMEOUT                  ((uint32_t)0xFFFFFFFF)
#define SD_0TO7BITS                     ((uint32_t)0x000000FF)
#define SD_8TO15BITS                    ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                   ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                   ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFF)

#define SD_HALFFIFO                     ((uint32_t)0x00000008)
#define SD_HALFFIFOBYTES                ((uint32_t)0x00000020)

/** 
* @brief  Command Class Supported 
*/
#define SD_CCCC_LOCK_UNLOCK             ((uint32_t)0x00000080)
#define SD_CCCC_WRITE_PROT              ((uint32_t)0x00000040)
#define SD_CCCC_ERASE                   ((uint32_t)0x00000020)

/** 
* @brief  Following commands are SD Card Specific commands.
*         SDIO_APP_CMD should be sent before sending these commands. 
*/
#define SDIO_SEND_IF_COND               ((uint32_t)0x00000008)

/**
* @}
*/ 

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Macros
* @{
*/
/**
* @}
*/ 

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Variables
* @{
*/
static uint32_t CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t CSD_Tab[4], CID_Tab[4], RCA = 0;
static uint32_t DeviceMode = SD_POLLING_MODE;
static uint32_t TotalNumberOfBytes = 0, StopCondition = 0;
static uint8_t SDSTATUS_Tab[16];

__IO SD_Error TransferError = SD_OK;
__IO uint32_t TransferEnd = 0, DMAEndOfTransfer = 0;
SD_CardInfo SDCardInfo;

SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;
/**
* @}
*/ 


/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Function_Prototypes
* @{
*/
static SD_Error CmdError(void);
static SD_Error CmdResp1Error(uint8_t cmd);
static SD_Error CmdResp7Error(void);
static SD_Error CmdResp3Error(void);
static SD_Error CmdResp2Error(void);
static SD_Error CmdResp6Error(uint8_t cmd, uint16_t *prca);
static SD_Error SDEnWideBus(FunctionalState NewState);
static SD_Error IsCardProgramming(uint8_t *pstatus);
static SD_Error FindSCR(uint16_t rca, uint32_t *pscr);
uint8_t convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes);

/**
* @}
*/ 

/**
* @brief  Configures SDIO IRQ channel.
* @param  None
* @retval None
*/
void SDIO_NVIC_Configuration(void)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	
	/* Configure the NVIC Preemption Priority Bits */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannel = SDIO_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	NVIC_InitStructure.NVIC_IRQChannel = DMA2_Stream3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_Init(&NVIC_InitStructure);  
}

