KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
	errorstatus = CmdResp1Error(SD_CMD_READ_SINGLE_BLOCK);
	
	if (errorstatus != SD_OK)
	{
		return(errorstatus);
	}
	
#if defined (SD_POLLING_MODE)  
	/*!< In case of single block transfer, no need of stop transfer at all.*/
	/*!< Polling mode */
	while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
	{
		if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
		{
			for (count = 0; count < 8; count++)
			{
				*(tempbuff + count) = SDIO_ReadData();
			}
			tempbuff += 8;
		}
	}
	
	if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
	{
		SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
		errorstatus = SD_DATA_TIMEOUT;
		return(errorstatus);
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
	{
		SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
		errorstatus = SD_DATA_CRC_FAIL;
		return(errorstatus);
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
	{
		SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
		errorstatus = SD_RX_OVERRUN;
		return(errorstatus);
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
	{
		SDIO_ClearFlag(SDIO_FLAG_STBITERR);
		errorstatus = SD_START_BIT_ERR;
		return(errorstatus);
	}
	count = SD_DATATIMEOUT;
	while ((SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) && (count > 0))
	{
		*tempbuff = SDIO_ReadData();
		tempbuff++;
		count--;
	}
	
	/*!< Clear all the static flags */
	SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	
#elif defined (SD_DMA_MODE)
    SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
    SDIO_DMACmd(ENABLE);
    SD_LowLevel_DMA_RxConfig((uint32_t *)readbuff, BlockSize);
#endif
	
	return(errorstatus);
}

/**
* @brief  Allows to read blocks from a specified address  in a card.  The Data
*         transfer can be managed by DMA mode or Polling mode. 
* @note   This operation should be followed by two functions to check if the 
*         DMA Controller and SD Card status.
*          - SD_ReadWaitOperation(): this function insure that the DMA
*            controller has finished all data transfer.
*          - SD_GetStatus(): to check that the SD Card has finished the 
*            data transfer and it is ready for data.   
* @param  readbuff: pointer to the buffer that will contain the received data.
* @param  ReadAddr: Address from where data are to be read.
* @param  BlockSize: the SD card Data block size. The Block size should be 512.
* @param  NumberOfBlocks: number of blocks to be read.
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_ReadMultiBlocks(uint8_t *readbuff, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	// 	uint32_t  *tempbuff;
	// 	SD_Error errorstatus = SD_OK;
	// 	TransferError = SD_OK;
	// 	TransferEnd = 0;
	// 	StopCondition = 1;
	// 	
	// 	SDIO->DCTRL = 0x0;
	// 	
	// 	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
	// 	{
	// 		BlockSize = 512;
	// 		ReadAddr /= 512;
	// 	}
	// 	
	// 	/*!< Set Block Size for Card */
	// 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
	// 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
	// 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	// 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	// 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	// 	SDIO_SendCommand(&SDIO_CmdInitStructure);
	// 	
	// 	errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
	// 	
	// 	if (SD_OK != errorstatus)
	// 	{
	// 		return(errorstatus);
	// 	}
	//     
	// 	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	// 	SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
	// 	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) 9 << 4;
	// 	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	// 	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	// 	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	// 	SDIO_DataConfig(&SDIO_DataInitStructure);
	// 	
	// 	/*!< Send CMD18 READ_MULT_BLOCK with argument data address */
	// 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)ReadAddr;
	// 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_READ_MULT_BLOCK;
	// 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	// 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	// 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	// 	SDIO_SendCommand(&SDIO_CmdInitStructure);
	// 	
	// 	errorstatus = CmdResp1Error(SD_CMD_READ_MULT_BLOCK);
	// 	
	// 	if (errorstatus != SD_OK)
	// 	{
	// 		return(errorstatus);
	// 	}
	// 	tempbuff = (uint32_t *)readbuff;
	// 	SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
	// 	SDIO_DMACmd(ENABLE);
	// 	SD_LowLevel_DMA_RxConfig(tempbuff, (NumberOfBlocks * BlockSize));
	// 	
	// 	return(errorstatus);
	
	SD_Error errorstatus = SD_OK;
	uint32_t count = 0; 
	uint32_t  *tempbuff;
	uint8_t power = 0;
	
	if (NULL == readbuff)
	{
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}
	
	TransferError = SD_OK;
	TransferEnd = 0;
	TotalNumberOfBytes = 0;
	
	/* Clear all DPSM configuration */
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 0;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_1b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	SDIO_DMACmd(DISABLE);
	
	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED)
	{
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}
	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
	{
		BlockSize = 512;
		ReadAddr /= 512;
	}
	
	/* Set the block size, both on controller and card */
	if ((BlockSize > 0) && (BlockSize <= 2048) && ((BlockSize & (BlockSize - 1)) == 0))
	{
		power = convert_from_bytes_to_power_of_two(BlockSize);
		
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		
