KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
		errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
		
		if (errorstatus != SD_OK)
		{
			return(errorstatus);
		}
	}
	else
	{
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}
	
	if (NumberOfBlocks > 1)
	{
		/* Common to all modes */
		if (NumberOfBlocks * BlockSize > SD_MAX_DATA_LENGTH)
		{
			errorstatus = SD_INVALID_PARAMETER;
			return(errorstatus);
		}
		
		TotalNumberOfBytes = NumberOfBlocks * BlockSize;
		StopCondition = 1;
		tempbuff = (uint32_t *)readbuff;
		
		SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
		SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
		SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) power << 4;
		SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
		SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
		SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
		SDIO_DataConfig(&SDIO_DataInitStructure);
		
		/* Send CMD18 READ_MULT_BLOCK with argument data address */
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)ReadAddr;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_READ_MULT_BLOCK;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		
		errorstatus = CmdResp1Error(SD_CMD_READ_MULT_BLOCK);
		
		if (errorstatus != SD_OK)
		{
			return(errorstatus);
		}
		
		if (DeviceMode == SD_POLLING_MODE)
		{
			/* Polling mode */
			while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
			{
				if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
				{
					for (count = 0; count < SD_HALFFIFO; count++)
					{
						*(tempbuff + count) = SDIO_ReadData();
					}
					tempbuff += SD_HALFFIFO;
				}
			}
			
			if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
				errorstatus = SD_DATA_TIMEOUT;
				return(errorstatus);
			}
			else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
				errorstatus = SD_DATA_CRC_FAIL;
				return(errorstatus);
			}
			else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
				errorstatus = SD_RX_OVERRUN;
				return(errorstatus);
			}
			else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_STBITERR);
				errorstatus = SD_START_BIT_ERR;
				return(errorstatus);
			}
			while (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)
			{
				*tempbuff = SDIO_ReadData();
				tempbuff++;
			}
			
			if (SDIO_GetFlagStatus(SDIO_FLAG_DATAEND) != RESET)
			{
				/* In Case Of SD-CARD Send Command STOP_TRANSMISSION */
				if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType))
				{
					/* Send CMD12 STOP_TRANSMISSION */
					SDIO_CmdInitStructure.SDIO_Argument = 0x0;
					SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_STOP_TRANSMISSION;
					SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
					SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
					SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
					SDIO_SendCommand(&SDIO_CmdInitStructure);
					
					errorstatus = CmdResp1Error(SD_CMD_STOP_TRANSMISSION);
					
					if (errorstatus != SD_OK)
					{
						return(errorstatus);
					}
				}
			}
			/* Clear all the static flags */
			SDIO_ClearFlag(SDIO_STATIC_FLAGS);
		}
		else if (DeviceMode == SD_INTERRUPT_MODE)
		{
			// 			SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_RXFIFOHF | SDIO_IT_STBITERR, ENABLE);
			// 			while ((TransferEnd == 0) && (TransferError == SD_OK))
			// 			{}
			// 			if (TransferError != SD_OK)
			// 			{
			// 				return(TransferError);
			// 			}
		}
		else if (DeviceMode == SD_DMA_MODE)
		{
			// 			SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
			// 			SDIO_DMACmd(ENABLE);
			// 			DMA_RxConfiguration(readbuff, (NumberOfBlocks * BlockSize));
			// 			while (DMA_GetFlagStatus(DMA2_FLAG_TC4) == RESET)
			// 			{}
			// 			while ((TransferEnd == 0) && (TransferError == SD_OK))
			// 			{}
			// 			if (TransferError != SD_OK)
			// 			{
			// 				return(TransferError);
			// 			}
		}
    }
	return(errorstatus);
}

/**
* @brief  This function waits until the SDIO DMA data transfer is finished. 
*         This function should be called after SDIO_ReadMultiBlocks() function
*         to insure that all data sent by the card are already transferred by 
*         the DMA controller.
* @param  None.
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_WaitReadOperation(void)
{
	SD_Error errorstatus = SD_OK;
	uint32_t timeout;
	
	timeout = SD_DATATIMEOUT;
	
	while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == SD_OK) && (timeout > 0))
	{
		timeout--;
	}
	
	DMAEndOfTransfer = 0x00;
	
	timeout = SD_DATATIMEOUT;
	
	while(((SDIO->STA & SDIO_FLAG_RXACT)) && (timeout > 0))
	{
		timeout--;  
	}
	
	if (StopCondition == 1)
	{
		errorstatus = SD_StopTransfer();
	}
	
	if ((timeout == 0) && (errorstatus == SD_OK))
	{
		errorstatus = SD_DATA_TIMEOUT;
	}
	
	/*!< Clear all the static flags */
	SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	
	if (TransferError != SD_OK)
	{
		return(TransferError);
	}
	else
	{
		return(errorstatus);  
	}
}

/**
* @brief  Allows to write one block starting from a specified address in a card.
*         The Data transfer can be managed by DMA mode or Polling mode.
* @note   This operation should be followed by two functions to check if the 
*         DMA Controller and SD Card status.
*          - SD_ReadWaitOperation(): this function insure that the DMA
*            controller has finished all data transfer.
*          - SD_GetStatus(): to check that the SD Card has finished the 
*            data transfer and it is ready for data.      
* @param  writebuff: pointer to the buffer that contain the data to be transferred.
* @param  WriteAddr: Address from where data are to be read.   
* @param  BlockSize: the SD card Data block size. The Block size should be 512.
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_WriteBlock(uint8_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize)
{
	SD_Error errorstatus = SD_OK;
	uint8_t  power = 0, cardstate = 0;
	uint32_t timeout = 0, bytestransferred = 0;
	uint32_t cardstatus = 0, count = 0, restwords = 0;
	uint32_t *tempbuff;
	
