KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
	if (writebuff == NULL)
	{
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}
	
	TransferError = SD_OK;
	TransferEnd = 0;
	TotalNumberOfBytes = 0;
	
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 0;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_1b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	SDIO_DMACmd(DISABLE);
	
	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED)
	{
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}
	
	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
	{
		BlockSize = 512;
		WriteAddr /= 512;
	}
	
	/*!< Set the block size, both on controller and card */
	if ((BlockSize > 0) && (BlockSize <= 2048) && ((BlockSize & (BlockSize - 1)) == 0))
	{
		power = convert_from_bytes_to_power_of_two(BlockSize);
		
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		
		errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
		
		if (errorstatus != SD_OK)
		{
			return(errorstatus);
		}
	}
	else
	{
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}
	
	/*!< Wait till card is ready for data Added */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);
	
	errorstatus = CmdResp1Error(SD_CMD_SEND_STATUS);
	
	if (errorstatus != SD_OK)
	{
		return(errorstatus);
	}
	
	cardstatus = SDIO_GetResponse(SDIO_RESP1);
	
	timeout = SD_DATATIMEOUT;
	
	while (((cardstatus & 0x00000100) == 0) && (timeout > 0))
	{
		timeout--;
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		
		errorstatus = CmdResp1Error(SD_CMD_SEND_STATUS);
		
		if (errorstatus != SD_OK)
		{
			return(errorstatus);
		}
		cardstatus = SDIO_GetResponse(SDIO_RESP1);
	}
	
	if (timeout == 0)
	{
		return(SD_ERROR);
	}
	
	/*!< Send CMD24 WRITE_SINGLE_BLOCK */
	SDIO_CmdInitStructure.SDIO_Argument = WriteAddr;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_WRITE_SINGLE_BLOCK;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);
	
	errorstatus = CmdResp1Error(SD_CMD_WRITE_SINGLE_BLOCK);
	
	if (errorstatus != SD_OK)
	{
		return(errorstatus);
	}
	
	TotalNumberOfBytes = BlockSize;
	StopCondition = 0;
	tempbuff = (uint32_t *)writebuff;
	
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) power << 4;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	
	/*!< In case of single data block transfer no need of stop command at all */
	if (DeviceMode == SD_POLLING_MODE)
	{
		while (!(SDIO->STA & (SDIO_FLAG_DBCKEND | SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
		{
			if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
			{
				if ((TotalNumberOfBytes - bytestransferred) < 32)
				{
					restwords = ((TotalNumberOfBytes - bytestransferred) % 4 == 0) ? ((TotalNumberOfBytes - bytestransferred) / 4) : (( TotalNumberOfBytes -  bytestransferred) / 4 + 1);
					
					for (count = 0; count < restwords; count++, tempbuff++, bytestransferred += 4)
					{
						SDIO_WriteData(*tempbuff);
					}
				}
				else
				{
					for (count = 0; count < 8; count++)
					{
						SDIO_WriteData(*(tempbuff + count));
					}
					tempbuff += 8;
					bytestransferred += 32;
				}
			}
		}
		if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
		{
			SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
			errorstatus = SD_DATA_TIMEOUT;
			return(errorstatus);
		}
		else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
		{
			SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
			errorstatus = SD_DATA_CRC_FAIL;
			return(errorstatus);
		}
		else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
		{
			SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
			errorstatus = SD_TX_UNDERRUN;
			return(errorstatus);
		}
		else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
		{
			SDIO_ClearFlag(SDIO_FLAG_STBITERR);
			errorstatus = SD_START_BIT_ERR;
			return(errorstatus);
		}
	}
	else if (DeviceMode == SD_INTERRUPT_MODE)
	{
// 		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_FLAG_TXFIFOHE | SDIO_IT_TXUNDERR | SDIO_IT_STBITERR, ENABLE);
// 		while ((TransferEnd == 0) && (TransferError == SD_OK))
// 		{}
// 		if (TransferError != SD_OK)
// 		{
// 			return(TransferError);
// 		}
	}
	else if (DeviceMode == SD_DMA_MODE)
	{
// 		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_TXUNDERR | SDIO_IT_STBITERR, ENABLE);
// 		SD_LowLevel_DMA_TxConfig((uint32_t *)writebuff, BlockSize);
// 		SDIO_DMACmd(ENABLE);
// 		while ((SD_DMAEndOfTransferStatus() == RESET) && (TransferEnd == 0) && (TransferError == SD_OK))
// 		{}
// 		if (TransferError != SD_OK)
// 		{
// 			return(TransferError);
// 		}
	}
	
	/*!< Clear all the static flags */
	SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	
	/*!< Wait till the card is in programming state */
	errorstatus = IsCardProgramming(&cardstate);
	
