KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
	while ((errorstatus == SD_OK) && ((cardstate == SD_CARD_PROGRAMMING) || (cardstate == SD_CARD_RECEIVING)))
	{
		errorstatus = IsCardProgramming(&cardstate);
	}
	
	return(errorstatus);
	
// 	SD_Error errorstatus = SD_OK;
// 	uint32_t bytestransferred = 0, count = 0, restwords = 0;
// 	uint32_t *tempbuff = (uint32_t *)writebuff;
// 	
// 	
// 	TransferError = SD_OK;
// 	TransferEnd = 0;
// 	StopCondition = 0;
// 	
// 	SDIO->DCTRL = 0x0;
// 	
// 	
// 	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
// 	{
// 		BlockSize = 512;
// 		WriteAddr /= 512;
// 	}
// 	
// 	/* Set Block Size for Card */ 
// 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
// 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
// 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
// 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
// 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
// 	SDIO_SendCommand(&SDIO_CmdInitStructure);
// 	
// 	errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
// 	
// 	if (SD_OK != errorstatus)
// 	{
// 		return(errorstatus);
// 	}
//     
// 	/*!< Send CMD24 WRITE_SINGLE_BLOCK */
// 	SDIO_CmdInitStructure.SDIO_Argument = WriteAddr;
// 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_WRITE_SINGLE_BLOCK;
// 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
// 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
// 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
// 	SDIO_SendCommand(&SDIO_CmdInitStructure);
// 	
// 	errorstatus = CmdResp1Error(SD_CMD_WRITE_SINGLE_BLOCK);
// 	
// 	if (errorstatus != SD_OK)
// 	{
// 		return(errorstatus);
// 	}
// 	
// 	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
// 	SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
// 	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) 9 << 4;
// 	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
// 	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
// 	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
// 	SDIO_DataConfig(&SDIO_DataInitStructure);
// 	
// 	/*!< In case of single data block transfer no need of stop command at all */
// 	if (DeviceMode == SD_POLLING_MODE)
// 	{
// 		while (!(SDIO->STA & (SDIO_FLAG_DBCKEND | SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
// 		{
// 			if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
// 			{
// 				if ((512 - bytestransferred) < 32)
// 				{
// 					restwords = ((512 - bytestransferred) % 4 == 0) ? ((512 - bytestransferred) / 4) : (( 512 -  bytestransferred) / 4 + 1);
// 					for (count = 0; count < restwords; count++, tempbuff++, bytestransferred += 4)
// 					{
// 						SDIO_WriteData(*tempbuff);
// 					}
// 				}
// 				else
// 				{
// 					for (count = 0; count < 8; count++)
// 					{
// 						SDIO_WriteData(*(tempbuff + count));
// 					}
// 					tempbuff += 8;
// 					bytestransferred += 32;
// 				}
// 			}
// 		}
// 		if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
// 		{
// 			SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
// 			errorstatus = SD_DATA_TIMEOUT;
// 			return(errorstatus);
// 		}
// 		else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
// 		{
// 			SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
// 			errorstatus = SD_DATA_CRC_FAIL;
// 			return(errorstatus);
// 		}
// 		else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
// 		{
// 			SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
// 			errorstatus = SD_TX_UNDERRUN;
// 			return(errorstatus);
// 		}
// 		else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
// 		{
// 			SDIO_ClearFlag(SDIO_FLAG_STBITERR);
// 			errorstatus = SD_START_BIT_ERR;
// 			return(errorstatus);
// 		}
// 	}else if (DeviceMode == SD_INTERRUPT_MODE)
// 	{
// 		
// 	}
// 	else if (DeviceMode == SD_DMA_MODE)
// 	{
// 	}
// 	
// 	
// 	return(errorstatus);
}

/**
* @brief  Allows to write blocks starting from a specified address in a card.
*         The Data transfer can be managed by DMA mode only. 
* @note   This operation should be followed by two functions to check if the 
*         DMA Controller and SD Card status.
*          - SD_ReadWaitOperation(): this function insure that the DMA
*            controller has finished all data transfer.
*          - SD_GetStatus(): to check that the SD Card has finished the 
*            data transfer and it is ready for data.     
* @param  WriteAddr: Address from where data are to be read.
* @param  writebuff: pointer to the buffer that contain the data to be transferred.
* @param  BlockSize: the SD card Data block size. The Block size should be 512.
* @param  NumberOfBlocks: number of blocks to be written.
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_WriteMultiBlocks(uint8_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	SD_Error errorstatus = SD_OK;
	uint8_t  power = 0, cardstate = 0;
	uint32_t bytestransferred = 0;
	uint32_t count = 0, restwords = 0;
	uint32_t *tempbuff ;
	
	if (writebuff == NULL)
	{
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}
	
	TransferError = SD_OK;
	TransferEnd = 0;
	TotalNumberOfBytes = 0;
	
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 0;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_1b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	SDIO_DMACmd(DISABLE);
	
	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED)
	{
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}
	
	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
	{
		BlockSize = 512;
		WriteAddr /= 512;
	}
	
	/* Set the block size, both on controller and card */
	if ((BlockSize > 0) && (BlockSize <= 2048) && ((BlockSize & (BlockSize - 1)) == 0))
	{
		power = convert_from_bytes_to_power_of_two(BlockSize);
		
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		
