KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
		errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
		
		if (errorstatus != SD_OK)
		{
			return(errorstatus);
		}
	}
	else
	{
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}
	
	/* Wait till card is ready for data Added */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);
	
	errorstatus = CmdResp1Error(SD_CMD_SEND_STATUS);
	
	if (errorstatus != SD_OK)
	{
		return(errorstatus);
	}
	
	if (NumberOfBlocks > 1)
	{
		/* Common to all modes */
		if (NumberOfBlocks * BlockSize > SD_MAX_DATA_LENGTH)
		{
			errorstatus = SD_INVALID_PARAMETER;
			return(errorstatus);
		}
		
		if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType))
		{
			/* To improve performance */
			SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
			SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);
			
			
			errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
			
			if (errorstatus != SD_OK)
			{
				return(errorstatus);
			}
			/* To improve performance */
			SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)NumberOfBlocks;
			SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCK_COUNT;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);
			
			errorstatus = CmdResp1Error(SD_CMD_SET_BLOCK_COUNT);
			
			if (errorstatus != SD_OK)
			{
				return(errorstatus);
			}
		}
		
		/* Send CMD25 WRITE_MULT_BLOCK with argument data address */
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)WriteAddr;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_WRITE_MULT_BLOCK;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		
		errorstatus = CmdResp1Error(SD_CMD_WRITE_MULT_BLOCK);
		
		if (SD_OK != errorstatus)
		{
			return(errorstatus);
		}
		
		TotalNumberOfBytes = NumberOfBlocks * BlockSize;
		StopCondition = 1;
		tempbuff = (uint32_t *)writebuff;
		
		SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
		SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
		SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) power << 4;
		SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
		SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
		SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
		SDIO_DataConfig(&SDIO_DataInitStructure);
		
		if (DeviceMode == SD_POLLING_MODE)
		{
			while (!(SDIO->STA & (SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
			{
				if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
				{
					if (!((TotalNumberOfBytes - bytestransferred) < SD_HALFFIFOBYTES))
					{
						for (count = 0; count < SD_HALFFIFO; count++)
						{
							SDIO_WriteData(*(tempbuff + count));
						}
						tempbuff += SD_HALFFIFO;
						bytestransferred += SD_HALFFIFOBYTES;
					}
					else
					{
						restwords = ((TotalNumberOfBytes - bytestransferred) % 4 == 0) ? ((TotalNumberOfBytes - bytestransferred) / 4) :
					((TotalNumberOfBytes - bytestransferred) / 4 + 1);
					
					for (count = 0; count < restwords; count++, tempbuff++, bytestransferred += 4)
					{
						SDIO_WriteData(*tempbuff);
					}
					}
				}
			}
			
			if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
				errorstatus = SD_DATA_TIMEOUT;
				return(errorstatus);
			}
			else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
				errorstatus = SD_DATA_CRC_FAIL;
				return(errorstatus);
			}
			else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
				errorstatus = SD_TX_UNDERRUN;
				return(errorstatus);
			}
			else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
			{
				SDIO_ClearFlag(SDIO_FLAG_STBITERR);
				errorstatus = SD_START_BIT_ERR;
				return(errorstatus);
			}
			
			if (SDIO_GetFlagStatus(SDIO_FLAG_DATAEND) != RESET)
			{
				if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType))
				{
					/* Send CMD12 STOP_TRANSMISSION */
					SDIO_CmdInitStructure.SDIO_Argument = 0x0;
					SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_STOP_TRANSMISSION;
					SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
					SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
					SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
					SDIO_SendCommand(&SDIO_CmdInitStructure);
					
					
					errorstatus = CmdResp1Error(SD_CMD_STOP_TRANSMISSION);
					
					if (errorstatus != SD_OK)
					{
						return(errorstatus);
					}
				}
			}
		}
		else if (DeviceMode == SD_INTERRUPT_MODE)
		{
			// 			SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_TXFIFOHE | SDIO_IT_TXUNDERR | SDIO_IT_STBITERR, ENABLE);
			// 			while ((TransferEnd == 0) && (TransferError == SD_OK))
			// 			{}
			// 			if (TransferError != SD_OK)
			// 			{
			// 				return(TransferError);
			// 			}
		}
		else if (DeviceMode == SD_DMA_MODE)
		{
			// 			SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_TXUNDERR | SDIO_IT_STBITERR, ENABLE);
			// 			SDIO_DMACmd(ENABLE);
			// 			DMA_TxConfiguration(writebuff, (NumberOfBlocks * BlockSize));
			// 			while (DMA_GetFlagStatus(DMA2_FLAG_TC4) == RESET)
			// 			{}
			// 			while ((TransferEnd == 0) && (TransferError == SD_OK))
			// 			{}
			// 			if (TransferError != SD_OK)
			// 			{
			// 				return(TransferError);
			// 			}
		}
  }
  
  /* Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
  
  /* Wait till the card is in programming state */
  errorstatus = IsCardProgramming(&cardstate);
  
