KitSprout/QCopterFlightControl/Program/QcopterFC_FlightControl Pre-Alpha/Program_Dirver/stm32f4_sdio.c
  while ((errorstatus == SD_OK) && ((cardstate == SD_CARD_PROGRAMMING) || (cardstate == SD_CARD_RECEIVING)))
  {
	  errorstatus = IsCardProgramming(&cardstate);
  }
  
  return(errorstatus);
  
  
  // 	SD_Error errorstatus = SD_OK;
  // 	
  // 	TransferError = SD_OK;
  // 	TransferEnd = 0;
  // 	StopCondition = 1;
  // 	
  // 	SDIO->DCTRL = 0x0;
  // 	
  // 	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
  // 	{
  // 		BlockSize = 512;
  // 		WriteAddr /= 512;
  // 	}
  // 	
  // 	/* Set Block Size for Card */ 
  // 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
  // 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
  // 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  // 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  // 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  // 	SDIO_SendCommand(&SDIO_CmdInitStructure);
  // 	
  // 	errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);
  // 	
  // 	if (SD_OK != errorstatus)
  // 	{
  // 		return(errorstatus);
  // 	}
  // 	
  // 	/*!< To improve performance */
  // 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
  // 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
  // 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  // 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  // 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  // 	SDIO_SendCommand(&SDIO_CmdInitStructure);
  // 	
  // 	
  // 	errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
  // 	
  // 	if (errorstatus != SD_OK)
  // 	{
  // 		return(errorstatus);
  // 	}
  // 	/*!< To improve performance */
  // 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)NumberOfBlocks;
  // 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCK_COUNT;
  // 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  // 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  // 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  // 	SDIO_SendCommand(&SDIO_CmdInitStructure);
  // 	
  // 	errorstatus = CmdResp1Error(SD_CMD_SET_BLOCK_COUNT);
  // 	
  // 	if (errorstatus != SD_OK)
  // 	{
  // 		return(errorstatus);
  // 	}
  // 	
  // 	
  // 	/*!< Send CMD25 WRITE_MULT_BLOCK with argument data address */
  // 	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)WriteAddr;
  // 	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_WRITE_MULT_BLOCK;
  // 	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  // 	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  // 	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  // 	SDIO_SendCommand(&SDIO_CmdInitStructure);
  // 	
  // 	errorstatus = CmdResp1Error(SD_CMD_WRITE_MULT_BLOCK);
  // 	
  // 	if (SD_OK != errorstatus)
  // 	{
  // 		return(errorstatus);
  // 	}
  // 	
  // 	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
  // 	SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
  // 	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) 9 << 4;
  // 	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
  // 	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  // 	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  // 	SDIO_DataConfig(&SDIO_DataInitStructure);
  // 	
  // 	SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
  // 	SDIO_DMACmd(ENABLE);
  // 	SD_LowLevel_DMA_TxConfig((uint32_t *)writebuff, (NumberOfBlocks * BlockSize));
  // 	SDIO_DMACmd(ENABLE);
  // 	return(errorstatus);
}

/**
* @brief  This function waits until the SDIO DMA data transfer is finished. 
*         This function should be called after SDIO_WriteBlock() and
*         SDIO_WriteMultiBlocks() function to insure that all data sent by the 
*         card are already transferred by the DMA controller.        
* @param  None.
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_WaitWriteOperation(void)
{
	SD_Error errorstatus = SD_OK;
	uint32_t timeout;
	
	timeout = SD_DATATIMEOUT;
	
	while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == SD_OK) && (timeout > 0))
	{
		timeout--;
	}
	
	DMAEndOfTransfer = 0x00;
	
	timeout = SD_DATATIMEOUT;
	
	while(((SDIO->STA & SDIO_FLAG_TXACT)) && (timeout > 0))
	{
		timeout--;  
	}
	
	if (StopCondition == 1)
	{
		errorstatus = SD_StopTransfer();
	}
	
	if ((timeout == 0) && (errorstatus == SD_OK))
	{
		errorstatus = SD_DATA_TIMEOUT;
	}
	
	/*!< Clear all the static flags */
	SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	
	if (TransferError != SD_OK)
	{
		return(TransferError);
	}
	else
	{
		return(errorstatus);
	}
}

/**
* @brief  Gets the cuurent data transfer state.
* @param  None
* @retval SDTransferState: Data Transfer state.
*   This value can be: 
*        - SD_TRANSFER_OK: No data transfer is acting
*        - SD_TRANSFER_BUSY: Data transfer is acting
*/
SDTransferState SD_GetTransferState(void)
{
	if (SDIO->STA & (SDIO_FLAG_TXACT | SDIO_FLAG_RXACT))
	{
		return(SD_TRANSFER_BUSY);
	}
	else
	{
		return(SD_TRANSFER_OK);
	}
}

/**
* @brief  Aborts an ongoing data transfer.
* @param  None
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_StopTransfer(void)
{
	SD_Error errorstatus = SD_OK;
	
	/*!< Send CMD12 STOP_TRANSMISSION  */
	SDIO_CmdInitStructure.SDIO_Argument = 0x0;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_STOP_TRANSMISSION;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);
	
	errorstatus = CmdResp1Error(SD_CMD_STOP_TRANSMISSION);
	
	return(errorstatus);
}

/**
* @brief  Allows to erase memory area specified for the given card.
* @param  startaddr: the start address.
* @param  endaddr: the end address.
* @retval SD_Error: SD Card Error code.
*/
SD_Error SD_Erase(uint32_t startaddr, uint32_t endaddr)
{
	SD_Error errorstatus = SD_OK;
	uint32_t delay = 0;
	__IO uint32_t maxdelay = 0;
	uint8_t cardstate = 0;
	
	/*!< Check if the card coomnd class supports erase command */
	if (((CSD_Tab[1] >> 20) & SD_CCCC_ERASE) == 0)
	{
		errorstatus = SD_REQUEST_NOT_APPLICABLE;
		return(errorstatus);
	}
	
